["Ingredients:\n1 cup daikon radish, grated and squeezed dry\n1/2 cup all-purpose flour\n1/4 cup room temperature water\n2 tablespoons black sesame seeds\n1 pinch white pepper\n1/2 teaspoon salt, for drawing out moisture\n1  scallion, chopped (optional)\n1 tablespoon soy sauce\n1 teaspoon wasabi\n\nInstructions:\nPrepare the Daikon Radish. You will need around 400 grams of raw, unpeeled Daikon radish for this recipe. Start by peeling the radish, then finely grate it with a grater or finely chop it with a knife. Add the salt, mix well to combine, and let stand for 15 minutes. After 15 minutes, take handfuls of the grated daikon and squeeze out as much liquid as possible; transfer the squeezed daikon into another bowl.\nPrepare the Batter. Add the all purpose flour in two batches, stirring in between additions. Follow that with room temperature water and mix well until a batter forms.\nFry the Pancakes. In a non-stick pan, heat up a touch of oil on medium-high heat. Once the pan is hot, spoon the batter on and shape them into round disks. Sprinkle on some black sesame seeds on the uncooked side of each pancake, and when the bottom becomes golden-brown, carefully flip them and fry until both sides are golden-brown. Remove them from the pan and let drain on a paper towel.\nPrepare the sauce. Make the sauce by simply mixing soy sauce and wasabi.", {"entities": [[13, 18, "QUANTITY"], [19, 57, "INGREDIENT"], [58, 65, "QUANTITY"], [66, 83, "INGREDIENT"], [84, 91, "QUANTITY"], [92, 114, "INGREDIENT"], [115, 128, "QUANTITY"], [129, 147, "INGREDIENT"], [156, 168, "INGREDIENT"], [169, 181, "QUANTITY"], [182, 212, "INGREDIENT"], [226, 233, "INGREDIENT"], [245, 257, "QUANTITY"], [258, 267, "INGREDIENT"], [268, 278, "QUANTITY"], [279, 285, "INGREDIENT"], [349, 358, "QUANTITY"], [511, 515, "INGREDIENT"], [517, 520, "PROCESS"], [607, 613, "INGREDIENT"], [741, 758, "INGREDIENT"], [775, 783, "PROCESS"], [823, 845, "INGREDIENT"], [850, 853, "PROCESS"], [935, 941, "INGREDIENT"], [1054, 1072, "INGREDIENT"], [1097, 1101, "INGREDIENT"], [1177, 1180, "PROCESS"], [1317, 1323, "PROCESS"], [1324, 1333, "INGREDIENT"], [1338, 1344, "INGREDIENT"]]}]