["Ingredients:\n2.25 cups (45o g) sweet potato puree, I used 2 medium-sized Okinawan Purple Sweet Potatoes\n1 cup glutinous rice flour, I used the Mochiko brand\n2 tablespoons water\n2 tablespoons brown sugar (or more if you like sweeter)\n1/2 cup white sesame seeds, to coat\nflakey kosher salt, for topping\n\nInstructions:\nMake the Sweet Potato Puree. Wrap the sweet potato (whole, unpeeled) in aluminum foil and roast it in a 400 degrees F (204 C) oven for around an hour. Test the potato's doneness with a parring knife and and once it's done, unwrap it and let cool in a refrigerator.\nMake the Dough. In a bowl, first combine brown sugar with the sweet potato puree (once it has cooled down). Also add the water and mix thoroughly to slightly re-hydrate the potatoes. Then, incrementally add the glutinous rice flour while mixing. Mix until a dough comes together and it no-longer sticks to your hands.\nMake the Cakes. Roll the dough out into a log and divide it into the number specified (for a 1x recipe, that is 16 cakes). Roll each portion into a ball, then flatten into a disk. Prepare a separate bowl with white sesame seeds and place each flattened cake into the bowl, pressing down to make sure the sesame sticks. Shake off excess sesame seeds and set aside. Repeat for all the potato cakes.\nCook the Cakes. Heat vegetable oil in a non-stick pan on medium-high heat. Once the vegetable oil is hot, place the cakes into the oil ( do not stack them!) and fry until both sides are crispy and lightly golden. Once done, move onto a paper towel to drain off excess grease and sprinkle with a dash of flakey kosher salt.", {"entities": [[31, 49, "INGREDIENT"], [104, 109, "QUANTITY"], [110, 156, "INGREDIENT"], [157, 170, "QUANTITY"], [171, 176, "INGREDIENT"], [177, 190, "QUANTITY"], [191, 202, "INGREDIENT"], [204, 211, "INGREDIENT"], [233, 240, "QUANTITY"], [241, 268, "INGREDIENT"], [276, 287, "INGREDIENT"], [331, 337, "INGREDIENT"], [354, 366, "INGREDIENT"], [406, 411, "PROCESS"], [476, 482, "INGREDIENT"], [622, 633, "INGREDIENT"], [643, 661, "INGREDIENT"], [694, 697, "PROCESS"], [702, 707, "INGREDIENT"], [712, 715, "PROCESS"], [754, 762, "INGREDIENT"], [784, 787, "PROCESS"], [802, 812, "INGREDIENT"], [819, 825, "PROCESS"], [1027, 1031, "INGREDIENT"], [1108, 1126, "INGREDIENT"], [1131, 1136, "PROCESS"], [1137, 1141, "INGREDIENT"], [1172, 1180, "PROCESS"], [1235, 1247, "INGREDIENT"], [1282, 1288, "INGREDIENT"], [1317, 1330, "INGREDIENT"], [1380, 1393, "INGREDIENT"], [1402, 1407, "PROCESS"], [1427, 1430, "INGREDIENT"], [1457, 1460, "PROCESS"], [1575, 1583, "PROCESS"], [1606, 1617, "INGREDIENT"]]}]