["Ingredients:\n400 grams (35-40) fresh brussels sprouts\n1 tablespoon vegetable oil\n1/4 cup vegetable oil\n12 cloves garlic, finely minced\n2 tablespoons gochugaru (Korean red chili powder)\nsalt, to taste\n\nInstructions:\nPrepare Brussels Sprouts. Pre-heating the oven to 425 F (220 C), and turn on the convection/fan setting if available. Start by slicing off the brown root-end of each brussels sprout, being careful not to slice off too much (so as to keep the outer leaves intact). Bring a pot of generously-salted water to boil, and cook the brussels sprouts until tender, about 10 minutes. Note: Salting the water here helps internally season the brussels sprouts. Don't skip it! Once tender, drain brussels sprouts and pour onto a parchment-lined baking sheet. Let cool for about 1-2 minutes.\nRoast Brussels Sprouts. Lightly pat the brussels sprouts dry with paper towel, then toss them with vegetable oil. One by one, use something with a flat-bottom (for example, large spoon or mug) to gently press into a disk that is about half the original height. Spread brussels sprouts to a single layer, leaving ample room between each brussels sprout for air to circulate. Note: Use more than one baking sheet if needed. Roast the brussels sprouts for 20-25 minutes, flipping once half-way through. Towards the end of baking, keep an eye on the brussels sprouts and pull them at your desired crispness/charring. A good amount of charring is tasty here.\nMake Garlic Chili Oil. In a pan or wok (still cold), simply combine vegetable oil, minced garlic, and red chili powder. Turn the heat up to low and let sizzle for about 5 minutes, or until smelling very fragrant. Taste and adjust seasoning with salt, and pour into a heat-proof bowl to cool. Note: for even more pungent garlic flavor, you can consider adding 1-2 cloves of fresh minced garlic to the finished chili oil. The flavor also gets better as you let it sit and infuse.\nAssembly. Place roasted brussels sprouts on a plate and drizzle all over with the garlic chili oil. Garnish with toasted sesame seeds, flaky salt, fresh parsley, and/or sliced scallions. Enjoy warm.", {"entities": [[13, 22, "QUANTITY"], [31, 36, "INGREDIENT"], [46, 53, "INGREDIENT"], [54, 66, "QUANTITY"], [67, 80, "INGREDIENT"], [81, 88, "QUANTITY"], [89, 102, "INGREDIENT"], [106, 112, "INGREDIENT"], [113, 119, "INGREDIENT"], [128, 134, "INGREDIENT"], [135, 148, "QUANTITY"], [149, 158, "INGREDIENT"], [167, 183, "INGREDIENT"], [185, 199, "INGREDIENT"], [376, 380, "INGREDIENT"], [512, 517, "INGREDIENT"], [521, 525, "PROCESS"], [531, 535, "PROCESS"], [549, 556, "INGREDIENT"], [607, 612, "INGREDIENT"], [655, 662, "INGREDIENT"], [707, 714, "INGREDIENT"], [747, 753, "PROCESS"], [842, 849, "INGREDIENT"], [892, 905, "INGREDIENT"], [996, 1001, "PROCESS"], [1070, 1077, "INGREDIENT"], [1124, 1128, "INGREDIENT"], [1191, 1197, "PROCESS"], [1234, 1241, "INGREDIENT"], [1312, 1318, "PROCESS"], [1348, 1355, "INGREDIENT"], [1465, 1468, "INGREDIENT"], [1515, 1528, "INGREDIENT"], [1530, 1543, "INGREDIENT"], [1549, 1565, "INGREDIENT"], [1692, 1696, "INGREDIENT"], [1767, 1773, "INGREDIENT"], [1786, 1789, "INGREDIENT"], [1799, 1805, "PROCESS"], [1810, 1816, "INGREDIENT"], [1820, 1825, "INGREDIENT"], [1826, 1839, "INGREDIENT"], [1856, 1865, "INGREDIENT"], [1941, 1948, "PROCESS"], [1958, 1965, "INGREDIENT"], [2007, 2013, "INGREDIENT"], [2014, 2023, "INGREDIENT"], [2038, 2058, "INGREDIENT"], [2066, 2070, "INGREDIENT"], [2072, 2085, "INGREDIENT"], [2101, 2110, "INGREDIENT"]]}]