["Ingredients:\n300 grams (1.5 cups) red adzuki beans (dry weight)\n9 cups water\n1.5 cups dark brown sugar\n1/4 teaspoon fine salt\n160 grams (1 cup + 2 tablespoons) sweet rice flour, or mochiko\n25 grams (2 tablespoons) sugar\n120 grams (1/2 cup) water\n\nInstructions:\nPrepare the Red Bean Soup. Soak red beans in cold water overnight, or at least 8 hours. Drain the red beans and place them in a large pot, along with water and salt. Note: Adding salt here is crucial as it prevents the red beans from splitting (an undesirable result for texture and appearance).\nCook the Red Bean Soup. Bring the water to a boil, and lower the heat to simmer covered for 1.5 to 2 hours. Stir occasionally in case anything sticks to the bottom. Once at your desired doneness, add brown sugar and stir to dissolve. Note: Be sure not to add sugar at the start as it will prevent the red beans from cooking properly. Taste and adjust sweetness accordingly. You want to cook the soup so that it's still a little on the runny side, as it will thicken a lot once it's cooled down.\nPrepare the Tang Yuan. You can do this while the red bean soup is cooking. In a bowl, combine sweet rice flour (mochiko) and sugar. Add water slowly while stirring with chopsticks or a spatula. Note: The amount of water you need varies from brand to brand. I am using Koda Farms Blue Star Mochiko Flour. Gather with your hands and knead until smooth. The dough should not be sticky, but still very soft & pliable. Divide the dough into 20-25 pieces. Roll each piece into a round ball and place them on a piece of parchment paper. Note: This helps the tang yuan keep their shape when you transfer them to boiling water. Dust with a little more sweet rice flour (or cornstarch, potato starch, etc.) to prevent sticking.\nCook the Tang Yuan.Â Bring a pot of water to boil. Lift the parchment paper and carefully slide the Tang Yuan into the pot, stirring immediately to make sure they do not stick. Simply cook until they float to the surface. Once they float, immediately place them in cold water. This stops the cooking and keeps them springy.\nTo Finish. Serve red bean soup hot with tang yuan. Optionally, drizzle a little bit of coconut cream on top.", {"entities": [[13, 22, "QUANTITY"], [64, 70, "QUANTITY"], [71, 76, "INGREDIENT"], [86, 102, "INGREDIENT"], [103, 115, "QUANTITY"], [116, 125, "INGREDIENT"], [126, 135, "QUANTITY"], [137, 142, "QUANTITY"], [143, 158, "INGREDIENT"], [166, 177, "INGREDIENT"], [189, 197, "QUANTITY"], [199, 212, "QUANTITY"], [214, 219, "INGREDIENT"], [220, 229, "QUANTITY"], [231, 238, "QUANTITY"], [240, 245, "INGREDIENT"], [306, 316, "INGREDIENT"], [373, 378, "PROCESS"], [411, 416, "INGREDIENT"], [421, 426, "INGREDIENT"], [440, 444, "INGREDIENT"], [591, 596, "INGREDIENT"], [602, 606, "PROCESS"], [753, 756, "PROCESS"], [757, 768, "INGREDIENT"], [773, 777, "PROCESS"], [812, 815, "PROCESS"], [816, 821, "INGREDIENT"], [873, 880, "PROCESS"], [943, 947, "PROCESS"], [1079, 1082, "INGREDIENT"], [1118, 1125, "PROCESS"], [1152, 1162, "INGREDIENT"], [1177, 1182, "INGREDIENT"], [1188, 1193, "INGREDIENT"], [1207, 1215, "PROCESS"], [1263, 1271, "INGREDIENT"], [1349, 1354, "INGREDIENT"], [1383, 1388, "PROCESS"], [1507, 1511, "INGREDIENT"], [1540, 1545, "PROCESS"], [1656, 1669, "INGREDIENT"], [1701, 1711, "INGREDIENT"], [1716, 1726, "INGREDIENT"], [1728, 1741, "INGREDIENT"], [1803, 1811, "INGREDIENT"], [1815, 1819, "PROCESS"], [1894, 1902, "PROCESS"], [1954, 1958, "PROCESS"], [2021, 2026, "PROCESS"], [2035, 2045, "INGREDIENT"], [2062, 2069, "PROCESS"], [2178, 2194, "INGREDIENT"]]}]