["Ingredients:\n1/4 cup kombu dashi broth\n1/4 cup water\n1/2 cup chickpea (garbanzo bean) flour, I used Bob's Red Mill\n1 teaspoon sugar (or more if you prefer a sweeter rolled omelette)\n1 teaspoon mirin\n1/8 teaspoon turmeric\n1 teaspoon soy sauce\n1/2 teaspoon baking powder\n4 tablespoons chickpea brine (aquafaba)\n1 sheet nori\n\nInstructions:\nPrepare the Chickpea Egg Batter.  Start by slowly adding water to the chickpea flour while whisking (to avoid lumps). Then, add all the remaining ingredients in the ingredients list except for the chickpea brine (Aquafaba) and nori.\nFinish the Batter. Using an electric mixer (or by hand), whip the chickpea brine (Aquafaba) until soft peaks form. Once it's whipped, add it to the chickpea egg batter and fold the two together (gently, so you keep most of the air bubbles you just whipped up).\nSplit the chickpea egg batter into approximately three portions, and split the sheet of nori into three rectangular portions as well.  In a small non-stick pan coated with vegetable oil (heated on medium-high heat), pour 1/3 of the batter in and spread it to a thin layer. As the egg batter begins to set (it should begin to set very fast), Add a sheet of nori in the middle and carefully roll up the omelette from one side to the other (I like to use a flipper and a pair of chopsticks to help me roll). Make sure the bottom of the egg has completely set by unsticking the sides and checking. Keep the omelette at that side, and oil the pan again, followed by another 1/3 of the chickpea egg batter. Repeat this process until you've used up all of the batter and all 3 of the nori pieces. Be careful not to cook the omelette for too long as it will stiffen up even more.\nShape the omelette. To achieve better shape with the rolled omelette, mould it with a Japanese bamboo mat (makisu). While the omelette is still hot, roll it up inside the bamboo mat and tie the whole thing up with a rubber band. Wait for around 5 minutes until you unwrap the bamboo mat and slice the omelette into 6 pieces (trimming off the sides). Enjoy warm.", {"entities": [[13, 20, "QUANTITY"], [21, 38, "INGREDIENT"], [39, 46, "QUANTITY"], [47, 52, "INGREDIENT"], [53, 60, "QUANTITY"], [61, 69, "INGREDIENT"], [86, 91, "INGREDIENT"], [115, 125, "QUANTITY"], [126, 131, "INGREDIENT"], [133, 140, "INGREDIENT"], [182, 192, "QUANTITY"], [193, 198, "INGREDIENT"], [199, 211, "QUANTITY"], [212, 220, "INGREDIENT"], [221, 231, "QUANTITY"], [232, 241, "INGREDIENT"], [242, 254, "QUANTITY"], [255, 268, "INGREDIENT"], [269, 282, "QUANTITY"], [283, 297, "INGREDIENT"], [299, 307, "INGREDIENT"], [387, 393, "PROCESS"], [394, 399, "INGREDIENT"], [407, 421, "INGREDIENT"], [461, 464, "PROCESS"], [534, 548, "INGREDIENT"], [550, 558, "INGREDIENT"], [636, 650, "INGREDIENT"], [652, 660, "INGREDIENT"], [704, 707, "PROCESS"], [718, 726, "INGREDIENT"], [841, 849, "INGREDIENT"], [1003, 1016, "INGREDIENT"], [1092, 1096, "PROCESS"], [1461, 1464, "INGREDIENT"], [1511, 1519, "INGREDIENT"], [1639, 1643, "PROCESS"]]}]