["Ingredients:\n500 grams all-purpose flour\n280 grams warm water\n5 grams instant yeast\n4 grams sugar\n3 cloves garlic, finely minced\n1 teaspoon fresh ginger, grated\n3  dried chilis, finely minced\n1 block (400 g) firm tofu, crumbled\n30 grams carrots, finely minced\n35 grams TVP, or textured vegetable protein (substitute: 8-10 shiitake mushrooms)\n2 tablespoon fermented garlic black bean paste, I used Lee Kum Kee's\n2 tablespoon doubanjiang, or spicy bean paste, I used Lee Kum Kee's\n2 tablespoons light soy sauce\n1 tablespoon dark soy sauce\n1/2 teaspoon ground five spice\n1 teaspoon ground Sichuan peppercorns\n3  scallions, chopped\n1 tablespoon cornstarch\nfine sea salt, to taste\n\nInstructions:\nPrepare the Dough.Â In a large mixing bowl, first combine flour, instant yeast, and sugar. Slowly stream in the warm water, and mix until a dough forms. Once a rough dough forms, turn it onto a generously floured surface and knead until smooth, around 7 minutes. Place the dough back into the bowl, then cover and let rest for 1-1.5 hours.\nPrepare the TVP. Soak the TVP in warm water for 10 minutes. After 10 minutes, drain the water and squeeze out excess liquid from the re-hydrated TVP. Set aside.\nPrepare Mapo Tofu Filling. First, drain the firm tofu well & mash it up with a fork (or crumble with your hands). In a pan or wok, heat up about 1 tablespoon of a neutral-flavored oil on medium-heat, and fry together garlic, ginger, and dried chilis until aromatic, about 1 minute. Add TVP, carrots, and tofu and cook until most liquid evaporates, around 7 minutes. Follow with soy sauces, fermented black bean paste, doubanjiang, ground Sichuan peppercorns, five spice, and cook for 2-3 more minutes. Finish by evenly distributing the cornstarch (you don't need to make a slurry), as well as sprinkling on scallions. Taste and adjust seasoning with salt, then place finished filling in the refrigerator to chill while you finish preparing the dough.\nMake the Buns. Take your rested dough and press it down to squeeze out excess air. Note: It's crucial that you squeeze out as much air as possible, so that the gas distribution would be even after the second proof. Make a hole in the middle of the dough and stretch it until it resembles a large donut, then tear at any point of the dough to get long log. Squeeze the dough through a gap made with your thumb and forefinger (or just use a knife) to get 20 equally-sized pieces of dough (see picture above for visuals). Roll and gather each piece of dough into a round, smooth ball.Â Take a ball of dough and first gently press it to flatten. Then take a floured rolling pin and roll the dough out on all sides into a round sheet, thickest at the center. Take each flattened doughÂ and place around two tablespoons of filling in the middle.Â Fold the dough up by pleating the sides (like an accordion) in a counter-clockwise motion. Towards the end, keep your thumb in the middle and press down while spiraling to seal. Pinch off excess dough on top if desired (but not too much). Place the completed buns into your bamboo steamer while you prepare the rest.\nSecond Proof and Steam. Proof the completed buns, this time uncovered, for another 45-60 minutes. Note: proofing uncovered develops a hardened \"shell\" on top of your bun, which will help keep all the pleats visible after steaming. Finally, steam the buns for 13-15 minutes. Once time is up, remove the bamboo steamer from the heat and wait for 5 minutes before opening it. Enjoy warm with extra doubanjiang and/or black bean sauce as desired.", {"entities": [[13, 22, "QUANTITY"], [23, 40, "INGREDIENT"], [41, 50, "QUANTITY"], [51, 61, "INGREDIENT"], [62, 69, "QUANTITY"], [70, 83, "INGREDIENT"], [84, 91, "QUANTITY"], [92, 97, "INGREDIENT"], [100, 106, "INGREDIENT"], [107, 113, "INGREDIENT"], [122, 128, "INGREDIENT"], [129, 139, "QUANTITY"], [140, 160, "INGREDIENT"], [185, 191, "INGREDIENT"], [201, 206, "QUANTITY"], [208, 227, "INGREDIENT"], [228, 236, "QUANTITY"], [237, 259, "INGREDIENT"], [260, 268, "QUANTITY"], [269, 303, "INGREDIENT"], [322, 340, "INGREDIENT"], [342, 354, "QUANTITY"], [355, 410, "INGREDIENT"], [411, 423, "QUANTITY"], [424, 478, "INGREDIENT"], [479, 492, "QUANTITY"], [493, 508, "INGREDIENT"], [509, 521, "QUANTITY"], [522, 536, "INGREDIENT"], [537, 549, "QUANTITY"], [550, 567, "INGREDIENT"], [568, 578, "QUANTITY"], [579, 605, "INGREDIENT"], [609, 618, "INGREDIENT"], [620, 627, "INGREDIENT"], [628, 640, "QUANTITY"], [641, 651, "INGREDIENT"], [661, 675, "INGREDIENT"], [722, 728, "PROCESS"], [749, 754, "INGREDIENT"], [756, 769, "INGREDIENT"], [775, 780, "INGREDIENT"], [803, 813, "INGREDIENT"], [819, 822, "PROCESS"], [916, 921, "PROCESS"], [1043, 1046, "INGREDIENT"], [1057, 1060, "INGREDIENT"], [1064, 1074, "INGREDIENT"], [1119, 1124, "INGREDIENT"], [1176, 1179, "INGREDIENT"], [1205, 1209, "INGREDIENT"], [1236, 1245, "INGREDIENT"], [1337, 1349, "QUANTITY"], [1372, 1375, "INGREDIENT"], [1396, 1399, "PROCESS"], [1409, 1415, "INGREDIENT"], [1417, 1423, "INGREDIENT"], [1478, 1481, "INGREDIENT"], [1483, 1490, "INGREDIENT"], [1496, 1500, "INGREDIENT"], [1505, 1509, "PROCESS"], [1603, 1608, "INGREDIENT"], [1610, 1621, "INGREDIENT"], [1623, 1649, "INGREDIENT"], [1656, 1661, "INGREDIENT"], [1667, 1671, "PROCESS"], [1728, 1738, "INGREDIENT"], [1799, 1808, "INGREDIENT"], [1842, 1846, "INGREDIENT"], [1853, 1858, "PROCESS"], [1985, 1990, "PROCESS"], [2478, 2482, "INGREDIENT"], [2564, 2569, "PROCESS"], [2702, 2706, "INGREDIENT"], [2728, 2733, "PROCESS"], [2926, 2931, "PROCESS"], [3322, 3330, "PROCESS"], [3341, 3346, "PROCESS"], [3496, 3507, "INGREDIENT"]]}]