["Ingredients:\n8 small scoops ice cream, I used my vegan matcha red bean ice cream\n160 grams (1 cup) sweet rice flour, or mochiko\n50 grams sugar\n236 grams (1 cup) room temperature water\npotato starch or corn starch, for dusting & rolling\n\nInstructions:\nPrepare Mini Ice Cream Scoops. Scoop ice cream into silicon muffin cups and freeze them until you're going to use wrap them in mochi. Alternatively, an empty egg carton lined with plastic wrap works great as well.\nMake the Mochi Dough. In a microwave-safe bowl, combine 1 cup (160 grams) of sweet rice flour (mochiko) and 50 grams of sugar. Whisk to combine first, then add 1 cup (236 grams) of water and whisk until completely smooth. Cover the bowl with plastic wrap, poke a few holes on top, and microwave on high heat for 1 minute. After 1 minute, use a wet spatula to mix up the dough. Repeat this two times with 1 more minute, then 30 more seconds (2 minutes 30 seconds total). Turn the dough onto a work surface that's been lined with parchment paper and heavily dusted with potato starch (or corn starch), and let cool for a little bit.\nRoll out & Cut. Dust both the top of the mochi dough and the rolling pin liberally with flour, and roll the dough out into a large rectangle. Once rolled out, chill in the refrigerator for 25-35 minutes, or until cooled and firmed up. After cooling, use a round cutter (or a small bowl) to cut the rolled out dough into 10 cm (4 inch) diameter circles.\nWrap the Ice Cream. Note: Before wrapping mochi, be sure to have plastic wrap ready on the side. Dust off as much potato starch as possible with a pastry brush, then place a scoop right in the middle. Fold up the sides, stretching as necessary, until the ice cream is completely encased. (I place the remaining scoops back into the freezer while I wrap each one up). Then, quickly wrap up the mochi ice cream and twist the top relatively tight, and place it back into the muffin cup/egg carton to keep its shape.\nTo Finish. Freeze the mochi ice creams for at least 1 hour before enjoying. If left overnight, let them thaw for at least 10 minutes, otherwise they will be too frozen.", {"entities": [[28, 31, "INGREDIENT"], [55, 61, "INGREDIENT"], [71, 74, "INGREDIENT"], [81, 90, "QUANTITY"], [92, 97, "QUANTITY"], [105, 116, "INGREDIENT"], [128, 136, "QUANTITY"], [137, 142, "INGREDIENT"], [143, 152, "QUANTITY"], [154, 159, "QUANTITY"], [161, 183, "INGREDIENT"], [184, 197, "INGREDIENT"], [201, 212, "INGREDIENT"], [264, 267, "INGREDIENT"], [288, 291, "INGREDIENT"], [365, 369, "PROCESS"], [439, 443, "PROCESS"], [521, 526, "QUANTITY"], [528, 537, "QUANTITY"], [548, 558, "INGREDIENT"], [573, 581, "QUANTITY"], [582, 590, "INGREDIENT"], [621, 624, "PROCESS"], [625, 630, "QUANTITY"], [632, 641, "QUANTITY"], [643, 651, "INGREDIENT"], [656, 661, "PROCESS"], [715, 719, "PROCESS"], [824, 827, "PROCESS"], [927, 932, "INGREDIENT"], [1033, 1046, "INGREDIENT"], [1051, 1062, "INGREDIENT"], [1184, 1189, "INGREDIENT"], [1458, 1461, "INGREDIENT"], [1522, 1526, "PROCESS"], [1563, 1576, "INGREDIENT"], [1615, 1620, "PROCESS"], [1704, 1707, "INGREDIENT"], [1740, 1745, "PROCESS"], [1797, 1801, "PROCESS"], [1802, 1806, "INGREDIENT"], [1830, 1834, "PROCESS"], [1848, 1851, "INGREDIENT"], [1898, 1903, "PROCESS"], [1928, 1931, "QUANTITY"], [1990, 1993, "INGREDIENT"], [2123, 2129, "INGREDIENT"]]}]