["Ingredients:\n480 grams (4 cups) all-purpose flour\n285 grams (1 cup + 3 tablespoons) water\n1/2 teaspoon fine salt\n2 tablespoons Chinese sesame paste (or tahini)\n1 teaspoon toasted sesame oil\n1 tablespoon rice vinegar\n1 tablespoon dark soy sauce\n1/2 teaspoon ground Sichuan pepper (up to 1 teaspoon)\n1 teaspoon ground five-spice\n60 grams (1/4 cup) warm water\n2 cloves fresh garlic, grated\n1  scallion, thinly sliced\n1 tablespoon chili oil (homemade recipe HERE)\n\nInstructions:\nMake the Wheat Gluten. In a big bowl, combine flour, water, and salt. Mix well and gather into a dough, adding water (one tablespoon at a time) as necessary. Knead the dough for about 5 minutes, or until smooth. Let rest for 1 hour for the gluten to develop & relax. Once rested, place the dough into a large bowl of water and begin washing out the wheat starches. The water should quickly turn murky, but keep washing until the water appears as murky white as can be, about 5-7 minutes. Reserve the first batch of starchy water in another large bowl (for the liang pi noodles), replace with new water, and continue to wash the dough. Replace with batches of new water as necessary until the water runs clear. Once clear, the washing process is done.\nCook the Wheat Gluten. Start by spreading the wheat gluten into a flat layer. Make sure you really flatten it as it is integral Place the wheat gluten into your steaming device of choice, and steam on medium-high heat for 20-25 minutes, or until cooked through. It should feel firm and slightly springy, but not soft/gummy. Once cooked, remove the wheat gluten from the heat and set it aside to cool.\nMake the Liang Pi Noodles. I usually do this on the next day, since you have to let the reserved starchy water have time to separate into its constituent starch and liquid layers (I let it set in the fridge overnight). Note: wait for 4-5 hours without disturbing the water if making on the same day. Once separated, ladle out the top layer of water, then slowly pour out any excess. Note: There is no concrete description for how thick the batter should be. Treat the first 1-2 noodle sheets as a diagnostic instead. Nonetheless, it's better to pour out more water here, since we can always re-add water to our batter if necessary. Ladle batter into a lightly-greased, flat-bottomed round pan (or cake pan) so that it just fills the entire surface. Note: I use a 20 cm (8 inch) diameter pan, which yields 5-6 noodle sheets at the end. Steam on medium heat for about 1-2 minutes, or until the noodle sheet just turns translucent. Remove the sheet from the pan and repeat with the rest of the batter. Note: this is where you can check the consistency of the batter. If the noodle appears rigid and begins to crack, add more water to the batter. Likewise, if the noodle turns out soft & sticky, try to remove some water from the batter. To make noodles, simply cut the sheets into about 2 cm (0.8 inches) wide strips. Set aside.\nMake Sesame Sauce. In a bowl, simply combine sesame paste (or tahini), toasted sesame oil, rice vinegar, dark soy sauce, Sichuan pepper, five-spice, and warm water (from steaming the noodles). Note: adding warm water here helps the sesame paste to not seize up too much. Mix well and set aside.\nAssembly. Place noodles in a bowl along with thinly sliced wheat gluten. Ladle over sesame sauce and a healthy amount of chili oil. Top with finely minced (or grated) garlic and scallions. Thinly sliced cucumbers and/or carrots are great toppings as well. Mix and enjoy warm.", {"entities": [[13, 22, "QUANTITY"], [24, 30, "QUANTITY"], [32, 49, "INGREDIENT"], [50, 59, "QUANTITY"], [61, 66, "QUANTITY"], [67, 82, "INGREDIENT"], [84, 89, "INGREDIENT"], [90, 102, "QUANTITY"], [103, 112, "INGREDIENT"], [113, 126, "QUANTITY"], [127, 147, "INGREDIENT"], [152, 158, "INGREDIENT"], [160, 170, "QUANTITY"], [171, 189, "INGREDIENT"], [190, 202, "QUANTITY"], [203, 215, "INGREDIENT"], [216, 228, "QUANTITY"], [229, 243, "INGREDIENT"], [244, 256, "QUANTITY"], [257, 278, "INGREDIENT"], [286, 296, "QUANTITY"], [298, 308, "QUANTITY"], [309, 326, "INGREDIENT"], [327, 335, "QUANTITY"], [337, 344, "QUANTITY"], [346, 356, "INGREDIENT"], [359, 365, "INGREDIENT"], [366, 371, "INGREDIENT"], [372, 378, "INGREDIENT"], [380, 386, "INGREDIENT"], [400, 413, "INGREDIENT"], [414, 426, "QUANTITY"], [427, 436, "INGREDIENT"], [521, 526, "INGREDIENT"], [528, 533, "INGREDIENT"], [539, 544, "INGREDIENT"], [579, 585, "PROCESS"], [586, 591, "INGREDIENT"], [755, 760, "PROCESS"], [789, 797, "INGREDIENT"], [844, 849, "INGREDIENT"], [904, 909, "INGREDIENT"], [936, 939, "INGREDIENT"], [998, 1003, "INGREDIENT"], [1071, 1076, "INGREDIENT"], [1138, 1143, "INGREDIENT"], [1167, 1172, "INGREDIENT"], [1272, 1284, "INGREDIENT"], [1364, 1376, "INGREDIENT"], [1387, 1395, "PROCESS"], [1418, 1423, "PROCESS"], [1472, 1478, "INGREDIENT"], [1555, 1561, "PROCESS"], [1574, 1586, "INGREDIENT"], [1732, 1737, "INGREDIENT"], [1781, 1787, "INGREDIENT"], [1894, 1899, "INGREDIENT"], [1967, 1975, "INGREDIENT"], [2186, 2191, "INGREDIENT"], [2207, 2210, "INGREDIENT"], [2221, 2224, "PROCESS"], [2225, 2230, "INGREDIENT"], [2650, 2653, "INGREDIENT"], [2740, 2743, "PROCESS"], [2749, 2754, "INGREDIENT"], [2838, 2843, "INGREDIENT"], [3005, 3010, "INGREDIENT"], [3015, 3021, "INGREDIENT"], [3024, 3042, "INGREDIENT"], [3044, 3056, "INGREDIENT"], [3058, 3072, "INGREDIENT"], [3082, 3088, "INGREDIENT"], [3095, 3100, "INGREDIENT"], [3106, 3116, "INGREDIENT"], [3123, 3131, "PROCESS"], [3152, 3158, "PROCESS"], [3159, 3169, "INGREDIENT"], [3192, 3197, "INGREDIENT"], [3293, 3306, "INGREDIENT"], [3307, 3319, "INGREDIENT"], [3369, 3378, "INGREDIENT"], [3396, 3402, "INGREDIENT"], [3407, 3413, "INGREDIENT"], [3415, 3421, "INGREDIENT"], [3426, 3435, "INGREDIENT"], [3468, 3475, "INGREDIENT"]]}]