["Ingredients:\n1  cups All-purpose flour\n1/4 cup Wheat germ\n3/4 cup Wheat bran\n1  tsp. Baking powder\n1 tsp. Salt\n1/3 cup Vegetable shortening\n3/4 cup Warm water\n\nInstructions:\nIn a large bowl combine the flour, wheat bran, wheat germ, baking powder, salt, and mix well. Add vegetable shortening and use your fingers to to rub the shortening into the flour mixture until completely incorporated.\nPour water in and mix with a fork until. If the dough is too dry, add a bit more water.\nScoop mixture out into a cutting board and knead until smooth (about 3-4 minutes). The dough should be soft and stretchy, but not as soft as bread dough.\nCover dough with plastic wrap and let rest for at least 1 hour. (The longer the dough rests the softer your tortillas will be.)\nDivide the dough into 12 equal pieces and roll into balls. Heat a cast iron skillet or comal to medium-high heat.\nSprinkle flour on your work surface, flatten the ball of dough with your hand. Using a rolling pin, begin to roll back and forth across the ball, rotating it slightly each time, and sprinkling more flour as necessary, until the dough has stretched out to make a large thin circle. Try to roll it as thin as you possibly can.\nLay the tortilla on the comal and flip after 30 to 40 seconds The tortilla should bubble up almost immediately. Cook 30 more seconds on the other side and remove from pan. Be careful not to overcook the tortillas or they will become crisp. Remove tortillas from pan and place in a tortilla warmer or kitchen towel.\nRepeat this process with the rest of the dough.", {"entities": [[13, 20, "QUANTITY"], [21, 38, "INGREDIENT"], [39, 46, "QUANTITY"], [47, 57, "INGREDIENT"], [58, 65, "QUANTITY"], [66, 76, "INGREDIENT"], [77, 83, "QUANTITY"], [85, 98, "INGREDIENT"], [99, 104, "QUANTITY"], [106, 110, "INGREDIENT"], [111, 118, "QUANTITY"], [119, 139, "INGREDIENT"], [140, 147, "QUANTITY"], [148, 158, "INGREDIENT"], [202, 207, "INGREDIENT"], [215, 219, "INGREDIENT"], [233, 246, "INGREDIENT"], [248, 252, "INGREDIENT"], [258, 261, "PROCESS"], [272, 292, "INGREDIENT"], [348, 353, "INGREDIENT"], [398, 403, "INGREDIENT"], [411, 414, "PROCESS"], [459, 462, "PROCESS"], [474, 479, "INGREDIENT"], [524, 529, "PROCESS"], [660, 664, "PROCESS"], [886, 891, "INGREDIENT"], [1044, 1048, "INGREDIENT"], [1075, 1080, "INGREDIENT"], [1145, 1149, "PROCESS"], [1176, 1180, "PROCESS"], [1197, 1200, "INGREDIENT"], [1472, 1477, "PROCESS"]]}]