["Ingredients:\n6 tbsp. Chickpea Flour\n6 tbsp. Water\n1 box Duncan Hines Moist Red Velvet Cake Mix\n1/3 cup Vegetable Oil\n1  cups Water\n1 lb. Vanilla Rolled Fondant\n cup Cornstarch\n1  Duncan Hines Whipped Vanilla Frosting\nGel food coloring\nGel writing icing pens\n\nInstructions:\nPreheat oven to 350F. Grease cake pan.\nIn a small bowl combine the chickpea flour and 6 tbsp. of water and mix well. Place the Duncan Hines cake mix in a large bowl and add the chickpea flour mixture, vegetable oil, and water. Mix well with a whisk until combined.\nPour cake batter into cake pan and bake for 20 to 25 min. or until a toothpick inserted comes out clean. Remove cake from over and let cool for 5 minutes in pan. Invert cake pan onto a rack and let cakes full off completely.\nRoll your fondant into 6 small balls about 3 inched wide. Sprinkle your counter with cornstarch and roll out fondant until  inch thick.\nSpread a thin layer of icing on the skull cakes and place fondant on top. Use your fingers to smooth out the fondant and fill the crevices of the skull. Tuck the fondant under the cake. Repeat this process with the rest if the cakes.\nPlace 1/8 tsp. of your favorite gel food coloring in small bowls dilute with about 1 -2 tsp. of water.\nNow comes the best part!! Paint your skulls with a paintbrush and the gel food coloring or with icing writing pens. Let icing paint dry then eat.", {"entities": [[13, 19, "QUANTITY"], [30, 35, "INGREDIENT"], [36, 42, "QUANTITY"], [44, 49, "INGREDIENT"], [95, 102, "QUANTITY"], [103, 116, "INGREDIENT"], [117, 124, "QUANTITY"], [125, 130, "INGREDIENT"], [161, 164, "QUANTITY"], [165, 175, "INGREDIENT"], [340, 354, "INGREDIENT"], [359, 365, "QUANTITY"], [367, 375, "INGREDIENT"], [380, 383, "PROCESS"], [418, 421, "PROCESS"], [442, 445, "PROCESS"], [450, 464, "INGREDIENT"], [474, 487, "INGREDIENT"], [493, 498, "INGREDIENT"], [516, 521, "PROCESS"], [573, 577, "PROCESS"], [848, 858, "INGREDIENT"], [908, 912, "PROCESS"], [951, 956, "PROCESS"], [1139, 1146, "QUANTITY"], [1226, 1234, "INGREDIENT"]]}]