["Ingredients:\n1 pack (.25 oz) Active dry yeast\n cup (3.5 oz) Almond milk (warm, 3.5 oz)\n3 1/3 cup (17.5 oz) Bread flour\n cup (5.5 oz) Sugar (granulated)\n1 tsp. Salt\n1 tsp. Orange zest\n cup Orange juice\n cup (6 oz.) Potato (Yukon gold, cooked, mashed)\n cup + 1 tbsp. (4  oz.) Vegan butter (room temperature, cut into 1 inch pieces,)\n2 tbsp. Vegan butter (melted)\n cup Sugar (granulated)\n\nInstructions:\nIn a medium bowl, dissolve the yeast in the almond milk and add 2 tbsp. of the flour. Whisk to incorporate and let rest in a warm place for 20 min.\nIn the bowl of a mixer, with the dough hook, combine the dry ingredients: the rest of the flour, salt, sugar, and orange zest. Mix.\nAdd the wet ingredients: the orange juice, mashed potato, and yeast-flour mixture. Mix on low until the dough begins to incorporate.\nAdd the  cup + 1 tbsp. of softened butter little by little and increase speed to medium. Mix for 15 min. until the dough has come off the sides of the bowl and is stretchy but not sticky.\nPlace the dough in a large oiled bowl, cover with a towel and let rise for 1 to 1  hours, or until doubled in size. Punch down the dough and fold the side over unto each other and flip. Cover the bowl with plastic wrap and refrigerate overnight.\nThe next day take the dough from the fridge, remove the plastic wrap and cover with a towel. Let rise in a warm place (70-75F) until the dough comes to room temperature, about an hour.\nTake a piece of dough, weighing about 3 oz., and set aside. Divide the remaining dough into four pieces. Roll them tightly into rounds and place on a sheet tray lined with parchment. Press down on the rounds lightly.\nUse the reserved dough to make 4 small balls the size of a quarter and set aside. Use the remaining dough to roll out eight strips long enough to cover the rounds. Place two strips on top of each round forming an x, use your fingers to press lightly on the strips to form knobs, they should resemble bones. Repeat the process with the rest of the rounds.\nCover with a towel and let rise for 1  hrs. in a warm place (70- 75F) or until double in size.\nMeanwhile preheat the oven to 350F. Place the small balls in the center of the rounds with a little bit of water. Bake for 20 min. until the rounds have become a rich brown color. If the bones are becoming too brown, cover with foil. Bake for 5 -10 more minutes or until the bread reaches an internal temperature of 190F or the bottom is golden brown. Remove from the oven and let cool on a rack.\nWhile the bread is still warm melt 2 tbsp. of butter and brush the bread with it. Sprinkle evenly with sugar.\nLet bread completely cool before eating.", {"entities": [[29, 45, "INGREDIENT"], [47, 50, "QUANTITY"], [60, 71, "INGREDIENT"], [87, 96, "QUANTITY"], [107, 118, "INGREDIENT"], [120, 123, "QUANTITY"], [133, 138, "INGREDIENT"], [152, 157, "QUANTITY"], [159, 163, "INGREDIENT"], [164, 169, "QUANTITY"], [184, 187, "QUANTITY"], [188, 200, "INGREDIENT"], [202, 205, "QUANTITY"], [207, 211, "QUANTITY"], [214, 220, "INGREDIENT"], [234, 240, "PROCESS"], [242, 248, "INGREDIENT"], [251, 254, "QUANTITY"], [255, 264, "INGREDIENT"], [266, 271, "QUANTITY"], [274, 286, "INGREDIENT"], [331, 337, "QUANTITY"], [339, 351, "INGREDIENT"], [362, 365, "QUANTITY"], [366, 371, "INGREDIENT"], [431, 436, "INGREDIENT"], [444, 455, "INGREDIENT"], [460, 463, "PROCESS"], [464, 470, "QUANTITY"], [479, 484, "INGREDIENT"], [530, 535, "PROCESS"], [638, 643, "INGREDIENT"], [645, 649, "INGREDIENT"], [651, 656, "INGREDIENT"], [662, 673, "INGREDIENT"], [709, 721, "INGREDIENT"], [723, 729, "INGREDIENT"], [730, 736, "INGREDIENT"], [742, 747, "INGREDIENT"], [748, 753, "INGREDIENT"], [822, 825, "QUANTITY"], [826, 835, "INGREDIENT"], [848, 854, "INGREDIENT"], [1166, 1170, "INGREDIENT"], [1215, 1219, "PROCESS"], [1311, 1315, "PROCESS"], [1359, 1364, "PROCESS"], [1470, 1474, "QUANTITY"], [1571, 1576, "PROCESS"], [1840, 1844, "INGREDIENT"], [1885, 1890, "PROCESS"], [2058, 2063, "PROCESS"], [2203, 2211, "INGREDIENT"], [2531, 2537, "QUANTITY"], [2542, 2548, "INGREDIENT"], [2599, 2604, "INGREDIENT"]]}]