["Ingredients:\n2 cups Japanese sushi rice\n1/4 cup rice vinegar\n2 tablespoons sugar or maple syrup\n1 teaspoon salt\nnori sheets\n7 oz firm tofu\n1  avocado\n1  cucumber\n2  carrots\nsoy sauce\n\nInstructions:\nRinse the sushi rice in a fine mesh colander under cold water.\nEither cook the rice in your Instant Pot or cook it on the stove top. If you are using an Instant Pot use the rice setting (low pressure for 12 minutes). Allow the pressure to release naturally. The rice should be tender and the water should be completely absorbed. If you are cooking it on the stove top, bring the rice with the water to a boil, then reduce the heat to low, cover, and cook for 20 minutes. I usually prefer to make sushi rice in my Instant Pot.\nCombine the rice vinegar, the sugar, and the salt in a small bowl. Add the cooked rice to a large bowl and stir in the vinegar sugar mixture until well combined. Let it cool down. Cover the bowl of rice with a damp napkin or kitchen cloth until it's ready to use.\nIn the meanwhile, cut the cucumber, the carrots, the avocado, and the tofu in thin strips. Heat some oil in a flat pan and cook the tofu strips for about 4 minutes on high heat until crispy. Add a tablespoon of soy sauce while cooking.\nPlace a nori sheet lengthwise on a bamboo rolling mat with the shiny side down. Fill a shallow bowl with cool water and wet your hands. Take a handful of rice and place it in the center of the nori sheet. Spread evenly, leaving a 3/4 - inch strip of the nori sheet uncovered on the top.\nPlace some thin strips of cucumber, carrot, tofu and avocado in a line on the near edge of the nori sheet. Make sure not to overfill the nori.\nTuck your thumbs underneath the bamboo mat and hold the ingredients with your fingers. Then roll the bamboo mat and the nori sheet towards your fingers with slight pressure. Make sure that the ingredients are fully covered with the rice and the nori sheet. Roll slowly to ensure that the sushi is rolled evenly.\nWet your fingers again in the shallow bowl of cool water and moisturize the uncovered strip of the nori sheet. Then completely roll up the nori sheet with the bamboo mat.&nbsp;\nPlace the sushi roll on a cutting board and carefully cut it in half with a sharp knife. Put the knife under cold water before and after cutting. Put the sushi halves beside each other and carefully cut them into small slices.\nSprinkle the vegan sushi rolls with sesame seeds and serve with soy sauce. If you want you could also add wasabi and pickled ginger.", {"entities": [[13, 19, "QUANTITY"], [20, 39, "INGREDIENT"], [40, 47, "QUANTITY"], [48, 60, "INGREDIENT"], [61, 74, "QUANTITY"], [75, 95, "INGREDIENT"], [96, 106, "QUANTITY"], [107, 111, "INGREDIENT"], [124, 128, "QUANTITY"], [129, 138, "INGREDIENT"], [165, 172, "INGREDIENT"], [173, 182, "INGREDIENT"], [214, 218, "INGREDIENT"], [249, 259, "INGREDIENT"], [268, 272, "PROCESS"], [277, 281, "INGREDIENT"], [305, 309, "PROCESS"], [371, 375, "INGREDIENT"], [460, 464, "INGREDIENT"], [490, 495, "INGREDIENT"], [538, 545, "PROCESS"], [577, 581, "INGREDIENT"], [591, 596, "INGREDIENT"], [602, 606, "PROCESS"], [648, 652, "PROCESS"], [700, 704, "INGREDIENT"], [736, 748, "INGREDIENT"], [754, 759, "INGREDIENT"], [769, 773, "INGREDIENT"], [799, 810, "INGREDIENT"], [831, 835, "PROCESS"], [843, 850, "INGREDIENT"], [851, 856, "INGREDIENT"], [922, 926, "INGREDIENT"], [1028, 1035, "INGREDIENT"], [1058, 1062, "INGREDIENT"], [1066, 1070, "PROCESS"], [1089, 1092, "INGREDIENT"], [1111, 1115, "PROCESS"], [1120, 1124, "INGREDIENT"], [1196, 1208, "INGREDIENT"], [1215, 1222, "PROCESS"], [1334, 1339, "INGREDIENT"], [1378, 1382, "INGREDIENT"], [1387, 1392, "PROCESS"], [1522, 1526, "PROCESS"], [1547, 1553, "INGREDIENT"], [1555, 1559, "INGREDIENT"], [1886, 1890, "INGREDIENT"], [2017, 2022, "INGREDIENT"], [2252, 2262, "INGREDIENT"], [2317, 2321, "INGREDIENT"], [2406, 2418, "INGREDIENT"], [2434, 2443, "INGREDIENT"], [2472, 2475, "PROCESS"], [2476, 2482, "INGREDIENT"], [2495, 2501, "INGREDIENT"]]}]