["Ingredients:\n1 1/2 cups all purpose flour (spooned and leveled)\n1 teaspoon sugar\n1/4 teaspoon salt\n1/4 cup (4 tablespoons) vegan butter, earth balance brand preferred, cold and cut into cubes\n1/4 cup (4 tablespoons) vegetable shortening, cold and into a few pieces\n3-4 tablespoons ice water\n\nInstructions:\nMake sure your vegan butter and shortening are very cold before starting. If you only have the tub of earth balance vegan butter, measure 4 tablespoons, then refrigerate along with the shortening for at least 30 minutes.&nbsp;\nAdd flour, sugar and salt to food processor with the \"S\" blade. Pulse a few times to combine.\nAdd cold vegan butter and shortening. Process for about 10 seconds, until it looks like a coarse meal (see photos above for reference).&nbsp;\nNow while the food processor is running, drizzle in 3 tablespoons of ice cold water. When it begins to clump together, stop. You may need to add 1 more tablespoon ice water for it to come together.&nbsp;\nDump the dough onto a lightly floured surface and shape it into a ball. Don't use your hands too much or it will warm the dough, which will make your pie crust less flaky and light.&nbsp;\nRoll the dough with a rolling pin to about a 12 inch circle, and transfer to a pie plate. I usually wrap it gently around my rolling pin and then carefully transfer it. Don't panic if it's not perfect, you can fix it in the pie plate!\nGently push the pie crust all around the dish, trimming off any excess and replacing any spots that need repair. See this tutorial for fluting the edges and making other special pie edges.\nIt's now ready to use immediately, or refrigerate until you are ready to use. Simply double the recipe for 2 pie crusts (top and bottom).&nbsp;", {"entities": [[13, 23, "QUANTITY"], [24, 41, "INGREDIENT"], [64, 74, "QUANTITY"], [75, 80, "INGREDIENT"], [81, 93, "QUANTITY"], [94, 98, "INGREDIENT"], [99, 106, "QUANTITY"], [108, 121, "QUANTITY"], [123, 135, "INGREDIENT"], [192, 199, "QUANTITY"], [201, 214, "QUANTITY"], [216, 236, "INGREDIENT"], [267, 280, "QUANTITY"], [281, 290, "INGREDIENT"], [321, 333, "INGREDIENT"], [408, 434, "INGREDIENT"], [444, 457, "QUANTITY"], [537, 542, "INGREDIENT"], [544, 549, "INGREDIENT"], [554, 558, "INGREDIENT"], [631, 648, "INGREDIENT"], [821, 834, "QUANTITY"], [838, 852, "INGREDIENT"], [910, 913, "PROCESS"], [932, 941, "INGREDIENT"], [1261, 1265, "PROCESS"], [1367, 1370, "INGREDIENT"]]}]