["Ingredients:\n16 ounce block super firm tofu*\n1/2 cup low sodium soy sauce ((use tamari for gluten free))\n2 tablespoons tomato paste\n2 tablespoons pure maple syrup\n2 tablespoons liquid smoke\nspray oil\n\nInstructions:\nRemove tofu from the package and pat dry with a paper towel. If you don&#x27;t have the super firm variety, you will need to press your tofu now.\nSlice the tofu very thin, about 1/8th inch thick. Place the tofu slices in a shallow bowl or container that you can marinate in.\nIn a medium bowl, whisk the low sodium soy sauce, tomato paste, maple syrup and liquid smoke together until smooth. Pour over the tofu slices and let them marinate for 1 hour in the refrigerator (overnight is fine is you prefer).\nPreheat the oven to 375 degrees F and spray a large baking sheet with oil. You could also line with parchment paper, but the oil works better.\nTransfer the tofu strips to the baking sheet, saving the marinade for later. Spray the tops of the tofu slices with oil and bake for 20 minutes. Flip gently (I used a fork), brush a little more marinade on, spray with oil again and bake for 15-20 more minutes.\nBe very careful not to burn them at this point. How long they will take depends on how thin you sliced them. Watch carefully; you want them to be crispy in places but not blackened to a crisp all over. If you prefer a chewy tofu bacon, take them out sooner. For crispier bacon, you may want to bake them a few extra minutes.\nRemove from the oven and serve immediately as a side dish, or between bread slices with vegan mayo, lettuce and tomato for Vegan BLT&#x27;s. Enjoy!", {"entities": [[13, 21, "QUANTITY"], [22, 44, "INGREDIENT"], [45, 52, "QUANTITY"], [53, 73, "INGREDIENT"], [80, 86, "INGREDIENT"], [105, 118, "QUANTITY"], [119, 131, "INGREDIENT"], [132, 145, "QUANTITY"], [146, 162, "INGREDIENT"], [163, 176, "QUANTITY"], [177, 189, "INGREDIENT"], [196, 199, "INGREDIENT"], [222, 226, "INGREDIENT"], [340, 345, "PROCESS"], [351, 355, "INGREDIENT"], [371, 375, "INGREDIENT"], [381, 385, "PROCESS"], [421, 425, "INGREDIENT"], [473, 476, "INGREDIENT"], [508, 513, "PROCESS"], [518, 538, "INGREDIENT"], [540, 552, "INGREDIENT"], [554, 565, "INGREDIENT"], [570, 582, "INGREDIENT"], [620, 624, "INGREDIENT"], [772, 778, "PROCESS"], [790, 793, "INGREDIENT"], [845, 848, "INGREDIENT"], [876, 880, "INGREDIENT"], [895, 901, "PROCESS"], [962, 966, "INGREDIENT"], [979, 982, "INGREDIENT"], [987, 991, "PROCESS"], [1081, 1084, "INGREDIENT"], [1095, 1099, "PROCESS"], [1211, 1215, "PROCESS"], [1348, 1352, "INGREDIENT"], [1418, 1422, "PROCESS"], [1537, 1547, "INGREDIENT"], [1561, 1567, "INGREDIENT"]]}]