["Ingredients:\n1 pound dry pinto beans (about 2 1/4 cups)\n1-2 tablespoons olive oil\n1  medium onion, chopped\n4  cloves garlic, minced\n6 cups water\n1 teaspoon chili powder\n1 teaspoon cumin\n1-2 teaspoons salt, to taste\n\nInstructions:\nRinse the pinto beans in a large colander, picking out any misshapen beans. Set aside.\nIn the Instant Pot, turn on the Saute feature and warm the olive oil. Add the onion and garlic and cook for 2-3 minutes, stirring constantly. Turn off the Instant Pot for a moment. Pour a small amount of water into the Instant Pot, and scrape along the bottom to remove any bits of food (this will help prevent the BURN message).\nAdd the dry pinto beans, the rest of the water, spices and 1 teaspoon of salt to the pot. Give it a little stir.\nPlace the lid on the Instant Pot and make sure the valve is set to &quot;sealing&quot;. Set to manual, high pressure for 40 minutes.\nOnce the timer goes off, allow the pressure to release naturally for 20 minutes, then vent any remaining pressure manually.\nKeep 2 cups of the liquid from the cooked beans in a bowl, then drain the rest of the liquid. Return the beans back to the pot.\nUse an immersion blender to blend the beans to the desired consistency, adding some of the reserved liquid as needed. The beans will continue to thicken as they cool. Add more salt to taste. Serve with any desired toppings and enjoy!", {"entities": [[44, 54, "QUANTITY"], [58, 71, "QUANTITY"], [72, 81, "INGREDIENT"], [92, 97, "INGREDIENT"], [99, 106, "INGREDIENT"], [110, 116, "INGREDIENT"], [117, 123, "INGREDIENT"], [125, 131, "INGREDIENT"], [132, 138, "QUANTITY"], [139, 144, "INGREDIENT"], [145, 155, "QUANTITY"], [156, 168, "INGREDIENT"], [169, 179, "QUANTITY"], [180, 185, "INGREDIENT"], [188, 199, "QUANTITY"], [200, 214, "INGREDIENT"], [376, 385, "INGREDIENT"], [395, 400, "INGREDIENT"], [405, 411, "INGREDIENT"], [416, 420, "PROCESS"], [438, 446, "PROCESS"], [518, 526, "INGREDIENT"], [688, 693, "INGREDIENT"], [706, 716, "QUANTITY"], [717, 724, "INGREDIENT"], [754, 758, "PROCESS"], [1022, 1028, "QUANTITY"], [1052, 1058, "INGREDIENT"], [1217, 1223, "PROCESS"], [1321, 1334, "INGREDIENT"]]}]