["Ingredients:\n1 cup dried shredded coconut (Use small shreds that are super fresh and white)\n10  soft dates (pitted)\n1/2-1 cup of nuts and seeds (such as pecans, pumpkin, chia seeds, cashews, etc)\n1 cup old fashioned oats\n1/4 tsp salt\n1/4 cup almond butter\n3-4 tsp maple syrup\n1/4 cup chocolate chips\n\nInstructions:\nAdd the coconut to a skillet over medium heat, and toast until lightly golden. Once the pan is heated, the coconut toasts really quickly, so watch the pan closely for about 3-4 minutes. Cool for a few min s\nTransfer the coconut and dates to a food processor, and process until dates have broken down consistently.\nAdd the seeds and nuts and process again until they are a coarse mixture and there are no large pieces. Add half of the oats and process again to break them down.\nAdd the rest of the oats, almond butter, maple syrup, and salt. Pulse a couple of times for the mixture to completely mix in. If the mixture isn&#039;t sticky enough, add another tsp of maple syrup, and pulse a couple of times again, then transfer this doughy mixture to a parchment-lined brownie pan. Press it down really well using a spatula or a spoon.\nMelt the chocolate on a double boiler until completely melted, then drizzle all over. Let the brownie pan sit in the fridge for at least an hour to set, then slice.Store in the fridge for up to a week.", {"entities": [[13, 18, "QUANTITY"], [19, 41, "INGREDIENT"], [75, 80, "INGREDIENT"], [101, 106, "INGREDIENT"], [120, 125, "QUANTITY"], [126, 143, "INGREDIENT"], [153, 160, "INGREDIENT"], [161, 168, "INGREDIENT"], [170, 180, "INGREDIENT"], [182, 189, "INGREDIENT"], [196, 201, "QUANTITY"], [202, 220, "INGREDIENT"], [221, 228, "QUANTITY"], [229, 233, "INGREDIENT"], [234, 241, "QUANTITY"], [242, 255, "INGREDIENT"], [258, 263, "QUANTITY"], [264, 275, "INGREDIENT"], [276, 283, "QUANTITY"], [284, 299, "INGREDIENT"], [323, 330, "INGREDIENT"], [422, 429, "INGREDIENT"], [535, 542, "INGREDIENT"], [547, 552, "INGREDIENT"], [592, 597, "INGREDIENT"], [637, 642, "INGREDIENT"], [647, 651, "INGREDIENT"], [749, 753, "INGREDIENT"], [812, 817, "INGREDIENT"], [818, 831, "INGREDIENT"], [833, 844, "INGREDIENT"], [850, 855, "INGREDIENT"], [910, 913, "PROCESS"], [959, 962, "PROCESS"], [975, 989, "INGREDIENT"], [1157, 1166, "INGREDIENT"]]}]