["Ingredients:\n4 tablespoons vegan cream cheese (*I used tofutti brand)\n2 tablespoons plain non-dairy yogurt OR coconut cream\n2 tablespoons granulated sugar\n1 teaspoon cornstarch\n3  Oreo cookies (*May use a similar cookie, such as Newman&#039;s Own if desired)\nnon-dairy whipped cream, optional for serving\n\nInstructions:\nIn a medium sized bowl, add the vegan cream cheese, non-dairy yogurt OR coconut cream, sugar and cornstarch. Stir or whisk until well combined, creamy and smooth. Set aside.\nCrush the Oreo cookies into crumbs. I do use by placing the cookies in a sandwich baggie and then crushing with a heavy mug. A blender or food processor works as well.\nLightly grease a large microwave safe mug or small ramekin (so you can easily remove the cheesecake). Sprinkle about half of the Oreo crumbs in the bottom of the mug and push down to create the crust.\nStir in the other half of the Oreo crumbs into the cheesecake mixture. Pour the cheesecake mixture into the mug, on top of the crust.\nPlace in the microwave and cook for 30 seconds, until you see a bubble in the middle then stop. Microwave for another 30 seconds, watching careful so it doesn&#039;t bubble over. The cheesecake should look mostly done especially on the edges, but may look a bit soft in the middle. If needed, microwave another 15-30 seconds. If you do this all at once, it will bubble over, which is why you need to stop a few times.\nPlace the mug in the refrigerator to chill and firm up for about an hour, if you can wait that long, until cool. You can gently pop it out of the mug and serve on a plate with non-dairy whipped cream, or eat it straight from the mug. Enjoy!", {"entities": [[13, 26, "QUANTITY"], [27, 45, "INGREDIENT"], [70, 83, "QUANTITY"], [84, 123, "INGREDIENT"], [124, 137, "QUANTITY"], [138, 154, "INGREDIENT"], [155, 165, "QUANTITY"], [166, 176, "INGREDIENT"], [344, 347, "PROCESS"], [352, 370, "INGREDIENT"], [372, 388, "INGREDIENT"], [392, 405, "INGREDIENT"], [407, 412, "INGREDIENT"], [417, 427, "INGREDIENT"], [437, 442, "PROCESS"], [729, 732, "INGREDIENT"], [1024, 1028, "PROCESS"], [1496, 1499, "INGREDIENT"], [1532, 1535, "INGREDIENT"]]}]