["Ingredients:\n1/2 cup vegan butter, slightly softened to room temperature ((8 tablespoons))\n8 ounces vegan cream cheese\n1 teaspoon pure vanilla extract\n4 cups powdered sugar, more if needed\n\nInstructions:\nIn a large mixing bowl, add the slightly softened vegan butter and beat with a hand mixer (or stand mixer) until creamy and smooth.&nbsp;\nDrain any extra liquid in the vegan cream cheese container, add it to the bowl and beat for 30 seconds to 1 minute to combine with the butter. Do not over beat at this point, or your frosting may be too runny.&nbsp;\nBeat in the vanilla to combine. With the mixer on low, gradually add the powdered sugar, 1 cup at a time, until thick and spreadable. I used 4 cups, but you may need a little more.&nbsp;\nAt this point, if your frosting still seems a bit too soft and runny for spreading, stick the bowl in the freezer for 15 minutes. Take it out, stir, and put it back in the freezer for another 15 minutes if needed, until a thick consistency is reached.\n*If using between cake layers, make sure your cakes are completely cooled before frosting. After you apply a thick layer of frosting to the first layer, place the cake in the refrigerator for 10 minutes, then frost the cake the rest of the way, however you desired. Cakes frosted with this vegan cream cheese frosting are best kept in the refrigerator, as most of the cream cheese is made with coconut oil and is not very stable at room temperature. You don't want the top layer to slip off (trust me, I've been there!)", {"entities": [[13, 20, "QUANTITY"], [21, 72, "INGREDIENT"], [75, 88, "QUANTITY"], [91, 99, "QUANTITY"], [100, 118, "INGREDIENT"], [119, 129, "QUANTITY"], [130, 150, "INGREDIENT"], [151, 157, "QUANTITY"], [158, 188, "INGREDIENT"], [215, 221, "PROCESS"], [228, 231, "PROCESS"], [245, 266, "INGREDIENT"], [372, 390, "INGREDIENT"], [402, 405, "PROCESS"], [477, 483, "INGREDIENT"], [570, 577, "INGREDIENT"], [623, 626, "PROCESS"], [631, 645, "INGREDIENT"], [647, 652, "QUANTITY"], [699, 705, "QUANTITY"], [888, 892, "PROCESS"], [1150, 1155, "PROCESS"], [1287, 1305, "INGREDIENT"], [1365, 1377, "INGREDIENT"], [1391, 1402, "INGREDIENT"]]}]