["Ingredients:\n1/2 recipe Peanut butter sauce\n1/2  red onion sliced\n1/2  bell pepper sliced (green or red)\n1/2  cup Sliced carrots\nsliced jalapenos\n1 tablespoon crushed peanuts\nMung Bean Sprouts (home sprouted or store bought or other sprouts)\nvegan cheese shreds of choice  (optional)\nsalt (pepper, lemon juice, cilantro and scallions for garnish)\nFor the Gluten-free Crust (or use any of my regular crusts)\n\nInstructions:\nMake the crust: Instructions below for the gluten-free crust\nIn a bowl whisk all the dry ingredients for the crust and keep aside.\nIn another bowl, combine water, yeast and sugar and let it sit until frothy. about 5 minutes. Add the flax seed meal and mix in. Let it sit for a minute.\nAdd the dry to the wet. Add in the yogurt and oil and mix well. Let the sticky dough sit for 10 minutes.\nUsing flour or oil on your hands shape the dough into a flat ball. Place ball on parchment lined pie pan.\nSpray water or oil, press with your hands and shape the dough to fit the pan with atleast 1/2 inch edge going up the sides. You can also use flour and roll the dough out between parchment sheets and then place in the pie pan.\nEven out the edges and let it sit for 15 minutes in a warm place. I usually put it near the oven when the over pre-heats.\nPreheat the oven to 400 degrees F / 200c.\nPlace another parchment on top of the pie pan. Bake for 10 minutes. Prep the veggies and peanut butter sauce.\nUncover and remove the pie pan from the oven. Pour the peanut sauce on the crust. Reserve a tablespoon or two sauce for garnish before serving. Layer the onions, bell peppers, crushed peanuts, carrots, jalapenos.\nLayer the sprouts, salt, pepper, lemon juice and vegan cheese shreds. Spray water on the crust edges.\nBake for 14 minutes. Broil for 1 to 2 minutes to brown the edges.\nTake the pizza out, Let it sit for 2 minutes before removing from parchment.\nDrizzle with the remaining peanut sauce. Garnish with pepper flakes, cilantro and scallions.\nSlice and serve.", {"entities": [[31, 37, "INGREDIENT"], [49, 58, "INGREDIENT"], [71, 82, "INGREDIENT"], [105, 113, "QUANTITY"], [114, 128, "INGREDIENT"], [146, 158, "QUANTITY"], [159, 174, "INGREDIENT"], [211, 223, "INGREDIENT"], [233, 240, "INGREDIENT"], [242, 261, "INGREDIENT"], [284, 288, "INGREDIENT"], [290, 296, "INGREDIENT"], [298, 309, "INGREDIENT"], [311, 319, "INGREDIENT"], [324, 333, "INGREDIENT"], [493, 498, "PROCESS"], [578, 583, "INGREDIENT"], [585, 590, "INGREDIENT"], [595, 600, "INGREDIENT"], [655, 669, "INGREDIENT"], [674, 677, "PROCESS"], [742, 748, "INGREDIENT"], [753, 756, "INGREDIENT"], [761, 764, "PROCESS"], [818, 823, "INGREDIENT"], [827, 830, "INGREDIENT"], [924, 929, "INGREDIENT"], [933, 936, "INGREDIENT"], [938, 943, "PROCESS"], [1046, 1049, "INGREDIENT"], [1059, 1064, "INGREDIENT"], [1122, 1127, "PROCESS"], [1203, 1208, "PROCESS"], [1385, 1392, "INGREDIENT"], [1397, 1410, "INGREDIENT"], [1572, 1578, "INGREDIENT"], [1580, 1592, "INGREDIENT"], [1594, 1609, "INGREDIENT"], [1611, 1618, "INGREDIENT"], [1641, 1648, "INGREDIENT"], [1650, 1654, "INGREDIENT"], [1656, 1662, "INGREDIENT"], [1664, 1675, "INGREDIENT"], [1680, 1699, "INGREDIENT"], [1707, 1712, "INGREDIENT"], [1930, 1943, "INGREDIENT"], [1945, 1953, "INGREDIENT"], [1958, 1967, "INGREDIENT"]]}]