["Ingredients:\n1 tablespoon ground flaxseeds\n3 tablespoons water\n1 1/2 cups almond flour*\n3/4 cup gluten free all purpose flour*\n1 tablespoon granulated sugar ((leave out for savory pies))\n1/4 teaspoon salt\n4-6 tablespoons additional tablespoons water\n\nInstructions:\nMake the flax egg by combining the ground flax and water together in a small bowl. Stir and set aside for 5 minutes, until it thickens. If pre-baking the crust, preheat the oven to 350 degrees F at this time.\nIn a large bowl, add the almond flour, gluten free flour, sugar (leave out for savory pies) and salt. Stir to combine.\nTo the bowl with the dry ingredients, add the thickened flax egg mixture and 4 tablespoons of additional water. Stir well with a large spoon until the dough comes together. Add an additional 1-2 tablespoons more water as needed. The dough is ready when you can squeeze it in your hands and it doesn&#039;t crumble; it should be moist but not too wet.\nForm the dough into a cohesive ball with your hands. If it&#039;s too wet, add a little more gluten free flour.\nPlace the ball of dough on a large piece of parchment paper or other clean surface sprinkled with gluten free flour to prevent sticking. Flatten the dough with your hands, sprinkle with flour, then use a rolling pin to roll it into an even circle about 12 inches in diameter.\nUse the parchment paper or rolling pin to carefully place the dough into your 9 inch pie plate. It&#039;s okay if it&#039;s not perfect. Gently press the dough into the pie plate and patch any tears with excess dough from the edges. Flute the edges if desired.\nWith a fork, poke all over the bottom of the crust.", {"entities": [[13, 25, "QUANTITY"], [26, 42, "INGREDIENT"], [43, 56, "QUANTITY"], [57, 62, "INGREDIENT"], [63, 73, "QUANTITY"], [74, 87, "INGREDIENT"], [88, 95, "QUANTITY"], [96, 126, "INGREDIENT"], [127, 139, "QUANTITY"], [140, 156, "INGREDIENT"], [187, 199, "QUANTITY"], [200, 204, "INGREDIENT"], [207, 220, "QUANTITY"], [221, 249, "INGREDIENT"], [300, 311, "INGREDIENT"], [316, 321, "INGREDIENT"], [408, 414, "PROCESS"], [491, 494, "PROCESS"], [499, 511, "INGREDIENT"], [525, 530, "INGREDIENT"], [532, 537, "INGREDIENT"], [570, 575, "INGREDIENT"], [631, 634, "PROCESS"], [639, 648, "PROCESS"], [670, 683, "QUANTITY"], [698, 703, "INGREDIENT"], [786, 799, "QUANTITY"], [805, 810, "INGREDIENT"], [850, 853, "INGREDIENT"], [1019, 1022, "PROCESS"], [1049, 1054, "INGREDIENT"], [1166, 1171, "INGREDIENT"], [1228, 1236, "PROCESS"], [1242, 1247, "INGREDIENT"], [1384, 1389, "PROCESS"], [1476, 1481, "PROCESS"]]}]