["Ingredients:\n1 Recipe Vegan Lemon Curd\n1 1/4 cups all purpose flour\n1/2 cup powdered sugar\n1/2 cup (8 Tbs) vegan butter, softened\n1/2 teaspoon pure vanilla extract\n1 tablespoon almond milk, as needed (*other non-dairy milks work as well)\n1/2 cup powdered sugar\n1-2 tablespoons almond milk\n\nInstructions:\nFirst, prepare Vegan Lemon Curd. You will want to make this a few hours before the cookies so it has time to cool and thicken, or make it a day or two before the cookies. You won&#039;t use all of it.\nPreheat the oven to 350 degrees F and lightly grease a baking sheet (or line with parchment paper).\nIn a large bowl, whisk the flour and powdered sugar together. Now add the vegan butter (softened) and vanilla and mix with a hand mixer (or stand mixer) on low-medium speed until mixed well. If the mixture is too crumbly to form into cookies, add a tablespoon of almond milk and mix in.\nThe dough might look a little crumbly but should smush together when squeezed in your hands. If not, add a touch more almond milk, but not too much or the cookies will spread when baking.\nShape the dough into small balls, about 1 tablespoon each. Gently indent the center of each cookie dough ball, making a place for the lemon curd to go. Place the cookies on the prepared pan.\nFill the cookies with cooled lemon curd, then bake for 10-12 minutes. The bottom of the cookies will be slightly golden, but otherwise they will appear underdone. They firm up as they cool.\nMake the glaze: In a small bowl, whisk the powdered sugar and almond milk together until smooth. If too runny, add more powdered sugar until it&#039;s quite thick for drizzling. If too thick, add a tiny bit of almond milk and whisk.\nOnce the cookies have cooled completely, drizzle the glaze over the tops and allow the glaze to set for several minutes. Serve and enjoy!", {"entities": [[39, 49, "QUANTITY"], [50, 67, "INGREDIENT"], [68, 75, "QUANTITY"], [76, 90, "INGREDIENT"], [91, 98, "QUANTITY"], [107, 129, "INGREDIENT"], [130, 142, "QUANTITY"], [143, 163, "INGREDIENT"], [164, 176, "QUANTITY"], [177, 199, "INGREDIENT"], [238, 245, "QUANTITY"], [246, 260, "INGREDIENT"], [263, 276, "QUANTITY"], [277, 288, "INGREDIENT"], [560, 566, "PROCESS"], [622, 627, "PROCESS"], [632, 637, "INGREDIENT"], [642, 656, "INGREDIENT"], [671, 674, "PROCESS"], [679, 691, "INGREDIENT"], [707, 714, "INGREDIENT"], [719, 722, "PROCESS"], [784, 789, "PROCESS"], [848, 851, "PROCESS"], [868, 879, "INGREDIENT"], [884, 887, "PROCESS"], [993, 996, "PROCESS"], [1005, 1021, "INGREDIENT"], [1072, 1078, "PROCESS"], [1120, 1132, "QUANTITY"], [1133, 1137, "INGREDIENT"], [1167, 1171, "INGREDIENT"], [1200, 1205, "PROCESS"], [1317, 1321, "PROCESS"], [1494, 1499, "PROCESS"], [1504, 1518, "INGREDIENT"], [1523, 1534, "INGREDIENT"], [1572, 1575, "PROCESS"], [1581, 1595, "INGREDIENT"], [1653, 1656, "PROCESS"], [1671, 1682, "INGREDIENT"], [1687, 1692, "PROCESS"]]}]