["Ingredients:\n1 cup split pigeon pea/toor dal (or use other split peas or red lentils)\n3.5 cups water\n1/2 tsp or more salt\n1/2  or 1 mango (ripe or unripe mango chopped small)\n1 tsp oil\n1.5 tsp mustard seeds (black mustard seeds - Raee)\n4 to 6  dried red chilies\n\nInstructions:\nWash and soak the split peas for half an hour. Drain, add to a deep saucepan with water. Partially cover and cook over medium heat for 25 to 30 minutes or until tender to preference. Add in the salt and mango and cook for 5 minutes. At this point you can also add some chopped tomato. Reduce heat to low and continue to simmer over low heat while you make the tempering. Mustard seeds in the tempering add a salty flavor profile, so start with less salt.\nMake the tempering: Heat oil in small skillet. When the oil is hot, add mustard seeds and let them start to pop. Use a lid if the popping gets too exuberant. Add dried red chilies and cook for a few seconds. At this point, you can also add in in some fresh or frozen curry leaves.\nAdd this tempering to the simmering dal. Mix in and take off heat. Taste and adjust salt and heat. Add in spice blend like garam masala or kolhapuri masala or sambhar masala for more flavor. Serve with an Indian meal with a veggie dry side (subzi), rice or flatbread, or serve as a soup with a dash of lemon and crackers or pita bread. Served in the pictures with panch phoron Bengali Veggies and lemon turmeric rice.", {"entities": [[13, 18, "QUANTITY"], [19, 44, "INGREDIENT"], [65, 69, "INGREDIENT"], [73, 84, "INGREDIENT"], [95, 100, "INGREDIENT"], [101, 108, "QUANTITY"], [109, 121, "INGREDIENT"], [160, 167, "INGREDIENT"], [175, 180, "QUANTITY"], [181, 184, "INGREDIENT"], [193, 206, "INGREDIENT"], [208, 227, "INGREDIENT"], [301, 305, "INGREDIENT"], [331, 334, "PROCESS"], [359, 364, "INGREDIENT"], [386, 390, "PROCESS"], [471, 475, "INGREDIENT"], [490, 494, "PROCESS"], [528, 531, "INGREDIENT"], [537, 540, "PROCESS"], [546, 560, "INGREDIENT"], [648, 661, "INGREDIENT"], [679, 682, "PROCESS"], [726, 731, "INGREDIENT"], [757, 760, "INGREDIENT"], [788, 791, "INGREDIENT"], [800, 803, "PROCESS"], [804, 817, "INGREDIENT"], [916, 920, "PROCESS"], [959, 962, "INGREDIENT"], [968, 971, "PROCESS"], [983, 998, "INGREDIENT"], [999, 1004, "INGREDIENT"], [1097, 1101, "INGREDIENT"], [1119, 1124, "INGREDIENT"], [1136, 1151, "INGREDIENT"], [1262, 1266, "INGREDIENT"], [1416, 1424, "INGREDIENT"], [1425, 1429, "INGREDIENT"]]}]