["Ingredients:\n2 cups bread flour\n1 cup whole wheat flour\n1/4 cup warm water\n2 teaspoons quick rising yeast\n2 cups thick lentil curry ((sambhar) blended to puree)\n3/4 teaspoon salt\n1 teaspoon sugar\n1/2 teaspoon black pepper\n1 teaspoon flax seeds\n1/2 cup finely chopped cilantro leaves\n1 tablespoon oil\n\nInstructions:\nLet the yeast sit in a quarter cup of warm water + 1 teaspoon sugar for 10 minutes or until frothy.\nGrease the stand mixer bowl lightly. In the stand mixer bowl , add in the flours, salt and pepper and give it a quick mix.\nAdd in the lentil curry(sambhar), cilantro leaves, oil and the yeast mixture and give them a quick mix with a spatula.\nKnead the dough for 2 minutes using the dough hook.\nScrape sides and knead again for 2 minutes. If mixing by hand, keep kneading till a nice soft and not very sticky dough is formed. The sambhar will make the dough generally stickier than normal bread dough and will also give the baked bun a very soft and moist texture.\nKnead in batched of 2 minutes with intermittent scraping till a soft dough is formed.\nCoat a bowl with oil and keep the dough in it , covered with a plastic wrap for rising.\nLet it rise for an hour. Punch it down and make small balls.\nUse the boule technique for a tighter crust and for the buns to rise more vertically ( pull dough gently using both hands in opp direction and tuck it in. Repeat 2-4 times to cover the circumference of the ball)\nPlace buns an inch apart on a greased baking sheet. I got 8 big buns.\nBrush water on the buns and stick some flax seeds on them.\nLet rise covered by a towel for half an hour.\nBake at 360 degrees F for 20 minutes. Times may very depending on the oven and amount and thickness of sambhar etc.\nCool on wire rack for half an hour before munching on these savory buns with some garlicky olive oil or coconut chutney!. I also used them as burger buns with a veggie patty!", {"entities": [[15, 31, "INGREDIENT"], [32, 37, "QUANTITY"], [38, 55, "INGREDIENT"], [60, 74, "INGREDIENT"], [75, 86, "QUANTITY"], [87, 105, "INGREDIENT"], [106, 112, "QUANTITY"], [113, 131, "INGREDIENT"], [154, 159, "INGREDIENT"], [161, 173, "QUANTITY"], [174, 178, "INGREDIENT"], [179, 189, "QUANTITY"], [190, 195, "INGREDIENT"], [196, 208, "QUANTITY"], [209, 221, "INGREDIENT"], [222, 232, "QUANTITY"], [233, 243, "INGREDIENT"], [244, 251, "QUANTITY"], [252, 282, "INGREDIENT"], [283, 295, "QUANTITY"], [296, 299, "INGREDIENT"], [323, 328, "INGREDIENT"], [346, 349, "QUANTITY"], [350, 363, "INGREDIENT"], [366, 376, "QUANTITY"], [377, 382, "INGREDIENT"], [478, 481, "PROCESS"], [497, 501, "INGREDIENT"], [506, 512, "INGREDIENT"], [533, 536, "PROCESS"], [572, 587, "INGREDIENT"], [589, 592, "INGREDIENT"], [601, 606, "INGREDIENT"], [637, 640, "PROCESS"], [726, 731, "PROCESS"], [756, 762, "PROCESS"], [938, 943, "PROCESS"], [1082, 1085, "INGREDIENT"], [1136, 1140, "PROCESS"], [1464, 1470, "PROCESS"], [1502, 1507, "INGREDIENT"], [1535, 1545, "INGREDIENT"], [1808, 1817, "INGREDIENT"], [1821, 1828, "INGREDIENT"]]}]