["Ingredients:\n1 cup vegan butter, softened to room temperature (earth balance brand sticks preferred)\n3/4 cup unsweetened cocoa powder (natural or dutch processed)\n3 1/2 cups powdered sugar\n2 teaspoons pure vanilla extract\n3 tablespoons unsweetened soy milk\n\nInstructions:\nSoften the vegan butter: If using the baking sticks, let them sit at room temperature for 15-30 minutes. If you are using the vegan butter in the tub, you can measure out 16 tablespoons (it equals 1 cup and is easier to measure out of the tub), and place in the mixing bowl for 10-15 minutes until softened. Avoid microwaving, but if you must, only microwave for 10 seconds at a time. If the butter melts at all your frosting will be difficult to work with.\nWith a hand mixer (or stand mixer with a whisk attachment), beat the butter on medium speed for about 2 minutes, until creamy.\nSift in the cocoa powder if clumpy, and add the powdered sugar, vanilla and soy milk. Beat on low speed for 30 seconds, then increase the speed to high and beat for 2-3 minutes, until combined and fluffy.\nIf the frosting is too thick, add another tablespoon of milk. If it&#x27;s too thin, add an additional 1/4 cup powdered sugar until the correct consistency is reached.\nUse immediately, or store in a covered container in the refrigerator for up to 1 week. When ready to use, let it come to room temperature, then mix it well or beat again before using. The frosting can also be frozen for 2-3 months.", {"entities": [[13, 18, "QUANTITY"], [19, 61, "INGREDIENT"], [101, 108, "QUANTITY"], [109, 133, "INGREDIENT"], [163, 173, "QUANTITY"], [174, 188, "INGREDIENT"], [189, 200, "QUANTITY"], [201, 221, "INGREDIENT"], [222, 235, "QUANTITY"], [236, 256, "INGREDIENT"], [283, 295, "INGREDIENT"], [310, 316, "PROCESS"], [398, 410, "INGREDIENT"], [427, 430, "INGREDIENT"], [443, 457, "QUANTITY"], [469, 474, "QUANTITY"], [521, 526, "PROCESS"], [534, 540, "PROCESS"], [664, 670, "INGREDIENT"], [771, 776, "PROCESS"], [799, 805, "INGREDIENT"], [869, 881, "INGREDIENT"], [897, 900, "PROCESS"], [905, 919, "INGREDIENT"], [921, 928, "INGREDIENT"], [933, 941, "INGREDIENT"], [1092, 1095, "PROCESS"], [1118, 1122, "INGREDIENT"], [1141, 1145, "PROCESS"], [1147, 1150, "PROCESS"], [1165, 1172, "QUANTITY"], [1173, 1187, "INGREDIENT"], [1374, 1377, "PROCESS"], [1427, 1430, "INGREDIENT"], [1439, 1445, "INGREDIENT"]]}]