["Ingredients:\n2 cups unsweetened soy milk*\n2 tablespoons instant rapid rise yeast*\n1/4 cup granulated sugar\n8 tablespoons vegan butter, softened\n5-5 1/2 cups all purpose flour\n2 teaspoons salt\n2 tablespoons melted vegan butter\n\nInstructions:\nWarm the soy milk in the microwave for a minute or two until warm, but not too hot or it will kill the yeast. Think bath water temperature.\nIn the bowl of a stand mixer (or a large bowl), add the warm milk, yeast and sugar. Give it a little stir with a spoon, and let sit for 3 minutes. The mixture should become foamy. If it doesn&#039;t, start again with fresh yeast.\nNow add theÂ softenedÂ vegan butter, 4 cups of flour and the salt. Use the dough hook and turn the mixer on low, mixing until all the flour is incorporated (Or mix with a spoon and knead by hand, see Notes). Add 1/2 cup of flour at a time, until a ball of dough is formed and the dough is pulling away fromÂ the sides of the bowl. It should be slightly sticky and soft, not too dry. Knead with the dough hook for about 5 minutes.\nTransfer the dough to a lightly greased bowl and cover with a towel. Let it rise for about 30 minutes in a warm place until it&#039;s about doubled in size.\nAfter 30 minutes, punch down the dough gently. To make rounded rolls, pat the dough into a large rectangle on a lightly floured surface and cut into 4 long strips. Next, cut those strips into 6 squares to make them even. To make them as smooth as possible, pull the seams downward so the top is smooth and place the less smooth side down. Then you will end up with very pretty rolls! You can also simply pinch off pieces of the dough and try to make them as round as possible.\nPlace the rolls on a quarter baking sheet or 9x13 inch baking dish, touching each other. Cover with the towel again and let rise for another 30 minutes.\nPreheat the oven to 375 degrees F. Remove the towel and bake for 12-15 minutes until golden brown and cooked in the middle. If the tops get too brown, use a piece of foil to coverÂ untilÂ they are done.\nRemoveÂ fromÂ the oven and immediately brush with meltedÂ vegan butter. Serve and enjoy! Keep leftovers in a coveredÂ container or ziplock bag for about 3 days. They can also be frozen.", {"entities": [[13, 19, "QUANTITY"], [20, 41, "INGREDIENT"], [42, 55, "QUANTITY"], [56, 81, "INGREDIENT"], [82, 89, "QUANTITY"], [90, 106, "INGREDIENT"], [107, 120, "QUANTITY"], [121, 143, "INGREDIENT"], [146, 156, "QUANTITY"], [157, 174, "INGREDIENT"], [175, 186, "QUANTITY"], [187, 191, "INGREDIENT"], [192, 205, "QUANTITY"], [206, 225, "INGREDIENT"], [250, 258, "INGREDIENT"], [344, 349, "INGREDIENT"], [362, 367, "INGREDIENT"], [429, 432, "PROCESS"], [437, 446, "INGREDIENT"], [448, 453, "INGREDIENT"], [458, 463, "INGREDIENT"], [482, 486, "PROCESS"], [598, 603, "INGREDIENT"], [604, 609, "INGREDIENT"], [615, 618, "PROCESS"], [634, 646, "INGREDIENT"], [648, 654, "QUANTITY"], [655, 663, "INGREDIENT"], [672, 677, "INGREDIENT"], [724, 730, "PROCESS"], [745, 750, "INGREDIENT"], [771, 774, "PROCESS"], [792, 797, "PROCESS"], [823, 830, "QUANTITY"], [831, 839, "INGREDIENT"], [1153, 1158, "PROCESS"], [1504, 1509, "PROCESS"], [1586, 1589, "INGREDIENT"], [1704, 1710, "PROCESS"], [1730, 1736, "PROCESS"], [1752, 1756, "INGREDIENT"], [1884, 1888, "PROCESS"], [1930, 1936, "INGREDIENT"], [2089, 2101, "INGREDIENT"], [2197, 2200, "INGREDIENT"], [2209, 2215, "INGREDIENT"]]}]