["Ingredients:\n2 1/2 cups all purpose flour\n3/4 cup powdered sugar\n1 1/4 cups vegan butter, softened\n1/2 teaspoon almond extract\n*if butter is unsalted, add a tiny pinch of salt\n1/2 cup seedless raspberry jam\n1 cup powdered sugar\n1 teaspoon almond extract\n2-3  teaspoons water, as needed\n\nInstructions:\nPreheat the oven to 350 degrees F and line two baking sheets withÂ parchment paper.\nIn a large bowl, stir the flour and powdered sugar together. Now add the softened butter and almond extract and mix with a hand mixer on low-medium speed until combined. The dough will look crumbly and soft but should smush together when squeezed in your hands. If it looks really crumbly, that means your butter was too cold. Use your hands to mush the dough together, the warmth from your hands will help it come together.\nShape the dough into 1 inch balls, about a tablespoon each, and place on baking sheets.Â \nMake a small indentation with your thumb or finger in the center of each cookie, then fill with about a teaspoon of jam.Â For flatter cookies, flatten the balls a bit first, then make the indentation.\nPlace the baking sheet with the cookies in the freezer for 10 minutes before baking, then place in the preheated oven and bake for 15-16 minutes. This helps the cookies bake perfectly and not spread or flatten. The cookies will still be light in color and appear a bit underdone when you take them out of the oven, but they firm up as they cool.\nLet cool for a few minutes on the pan, then transfer to a wire rack to cool completely.\nMake the glaze: Whisk all ingredients in a small bowl until smooth, adding water as needed to thin the icing. You want it to be pretty thick and not too thin. Add the glaze to a small bag, cut a small tip from a corner and drizzle over the cooled cookies. Let them set, then store cookies in an airtight container.", {"entities": [[13, 23, "QUANTITY"], [24, 41, "INGREDIENT"], [42, 49, "QUANTITY"], [50, 64, "INGREDIENT"], [65, 75, "QUANTITY"], [76, 98, "INGREDIENT"], [99, 111, "QUANTITY"], [112, 126, "INGREDIENT"], [131, 137, "INGREDIENT"], [151, 154, "PROCESS"], [162, 175, "INGREDIENT"], [176, 183, "QUANTITY"], [184, 206, "INGREDIENT"], [207, 212, "QUANTITY"], [213, 227, "INGREDIENT"], [228, 238, "QUANTITY"], [239, 253, "INGREDIENT"], [256, 268, "QUANTITY"], [269, 285, "INGREDIENT"], [348, 354, "PROCESS"], [402, 406, "PROCESS"], [411, 416, "INGREDIENT"], [421, 435, "INGREDIENT"], [450, 453, "PROCESS"], [467, 473, "INGREDIENT"], [478, 492, "INGREDIENT"], [497, 500, "PROCESS"], [691, 697, "INGREDIENT"], [864, 868, "INGREDIENT"], [874, 879, "PROCESS"], [883, 889, "PROCESS"], [968, 972, "INGREDIENT"], [1111, 1117, "PROCESS"], [1178, 1184, "PROCESS"], [1191, 1196, "PROCESS"], [1223, 1227, "PROCESS"], [1270, 1274, "PROCESS"], [1603, 1609, "PROCESS"], [1610, 1633, "INGREDIENT"], [1688, 1692, "PROCESS"]]}]