["Ingredients:\n1/2 cup solid not melted organic refined coconut oil (on the scant side)\n1.5 tablespoons ground flax seeds mixed with 4.5 tablespoons water (let sit for 5 mins until smooth and creamy)\n1/2 cup brown sugar\n1/4 cup organic unrefined sugar (fine sugar or blend to make powder)\n1/4 teaspoon heaped fine sea salt\n1/2 teaspoon baking soda\n1 teaspoon baking powder\n2 tsp organic vanilla extract\n1 1/4  cups flour (I use unbleached white flour)\n1 cup vegan fair trade palmoil free chocolate chips and chunks\n\nInstructions:\nPreheat the oven to 350 degrees F / 180c. Line a large baking sheet with parchment.\nAdd all ingredients coconut oil through vanilla extract to a stand mixer and beat until light and fluffy. Or add a bowl and beat with a hand held beater until fluffy.\nAdd 1 cup flour and mix in. Add 1/4 cup flour and mix in. Add flour 1 tbsp at a time and beat in to make a soft cookie dough. You dont want a crumbly dryish mixture, so add just enough to get to somewhere between a stiff batter and soft dough. *\nAdd the chocolate chips and fold in well. **\nMeasure dough out by heaped tablespoon or a scoop on the lined baking sheet.\nBake for 10 minutes or until just slightly golden.\nRemove from oven and \"cookie slam\" on a solid heat proof surface for the wrinkled cookie appearance.\nLet cool on baking sheet for 2-3 minutes. Transfer to a cooling rack and let cool for another 3-5 minutes. The cookies set up while they cool. Try to share with everyone. Store on the counter for the day, and in a closed container for upto 3 days (totally irrelevant information),", {"entities": [[13, 20, "QUANTITY"], [21, 65, "INGREDIENT"], [102, 152, "INGREDIENT"], [198, 205, "QUANTITY"], [206, 217, "INGREDIENT"], [218, 225, "QUANTITY"], [226, 249, "INGREDIENT"], [256, 261, "INGREDIENT"], [287, 299, "QUANTITY"], [300, 320, "INGREDIENT"], [321, 333, "QUANTITY"], [334, 345, "INGREDIENT"], [346, 356, "QUANTITY"], [357, 370, "INGREDIENT"], [371, 376, "QUANTITY"], [377, 400, "INGREDIENT"], [401, 412, "QUANTITY"], [413, 418, "INGREDIENT"], [426, 448, "INGREDIENT"], [450, 455, "QUANTITY"], [456, 512, "INGREDIENT"], [583, 589, "PROCESS"], [632, 643, "INGREDIENT"], [652, 667, "INGREDIENT"], [721, 724, "PROCESS"], [783, 788, "QUANTITY"], [789, 794, "INGREDIENT"], [799, 802, "PROCESS"], [811, 818, "QUANTITY"], [819, 824, "INGREDIENT"], [829, 832, "PROCESS"], [841, 846, "INGREDIENT"], [847, 853, "QUANTITY"], [948, 951, "PROCESS"], [1033, 1048, "INGREDIENT"], [1133, 1139, "PROCESS"], [1311, 1317, "PROCESS"]]}]