["Ingredients:\n1 cup chickpea flour/ garbanzo bean flour (use 1 1/4 cup besan/ gram flour)\n1/2-3/4 tsp salt\n1/4 tsp garlic powder\n1/4 tsp turmeric (optional, for color)\n1/4 tsp cumin or garam masala (optional)\n1 3/4 cup water\n\nInstructions:\nGrease a bread pan or line with parchment and keep ready. (9 by 5 rectangle or any similar rectangle or smaller square pan).\nIn a bowl whisk all the ingredients under chickpea tofu until there are no lumps, or use a blender..(or you can add the ingredients directly to the pan and whisk to combine). I use a blender for quick and smooth batter.\nPour the chickpea flour mixture into a deep saucepan. Cook over medium heat. Stir continuously. The mixture will start to get lumpy as the pan heats up (see video) and then thicken evenly and considerably. 4 to 5 mins.\nOnce the mixture is evenly thick and stiff, keep cooking for another 2 minutes so the chickpea flour gets cooked through. Also tap the spoon or spatula to drop the mixture stuck to it to the pan. If the mixture is starting to brown, reduce the heat to medium low. You can taste test the mixture at this point carefully, to ensure that there is no raw chickpea flour flavor and adjust salt if needed.\nPour the mixture into the prepared loaf pan or parchment and even it out using a spatula or another parchment if needed. Let it cool, then refrigerate for atleast an hour to set.\nRemove the set slab from the pan. Slice into cubes. Store in an airtight container refrigerated for upto 4 days. The tofu can leak some moisture while it sits. drain and use.", {"entities": [[13, 18, "QUANTITY"], [19, 54, "INGREDIENT"], [60, 69, "QUANTITY"], [77, 87, "INGREDIENT"], [93, 100, "QUANTITY"], [101, 105, "INGREDIENT"], [106, 113, "QUANTITY"], [114, 127, "INGREDIENT"], [128, 135, "QUANTITY"], [136, 144, "INGREDIENT"], [167, 174, "QUANTITY"], [175, 196, "INGREDIENT"], [208, 217, "QUANTITY"], [218, 223, "INGREDIENT"], [374, 379, "PROCESS"], [406, 419, "INGREDIENT"], [472, 475, "INGREDIENT"], [476, 479, "PROCESS"], [520, 525, "PROCESS"], [593, 607, "INGREDIENT"], [852, 859, "PROCESS"], [889, 903, "INGREDIENT"], [909, 915, "PROCESS"], [1071, 1074, "INGREDIENT"], [1154, 1168, "INGREDIENT"], [1187, 1191, "INGREDIENT"], [1499, 1503, "INGREDIENT"], [1504, 1507, "INGREDIENT"]]}]