["Ingredients:\n1 1/2 Cups Vegan Semi-Sweet Chocolate\n1/2 Cups Vegan Peanut Butter Chips ((see notes for substitute))\n2 tbsp peanut butter\n1/3 cup coarsely chopped roasted peanuts ( crushed roasted (salted or unsalted based on preference), cashews also work )\n\nInstructions:\nMelt the chocolate in a bowl on a double boiler, or in a microwave. If melting in microwave, melt in 30-second bursts, then mix to avoid the chocolate seizing up.\nOnce a good portion of the chocolate is melted, use a spoon and mix really well, and the heat in the bowl will melt the rest of the chocolate. Mix until the mixture is really smooth.\nMelt the peanut butter chips and peanut butter in a bowl on a double boiler, or in a microwave. If using a microwave, melt them in bursts of 20 seconds. Once the mixture is starting to melt, just use a spoon to mix really well, and the mixture will become smooth.\nChop or crush your peanuts, and set aside.\nOn parchment paper, spread the melted chocolate evenly with a spatula into a 11x9 inch rectangle. Then spoon the melted peanut butter onto the chocolate layer, then use a toothpick or a knife to criss-cross over it to design how you like. Then sprinkle the crushed peanuts, lightly press so they don&#039;t fall off later on.\nRefrigerate  for 30 minutes to set, then use a sharp knife to slice, and store.\nThe bark can be stored in the fridge for over a month.", {"entities": [[13, 23, "QUANTITY"], [24, 50, "INGREDIENT"], [51, 59, "QUANTITY"], [60, 85, "INGREDIENT"], [115, 121, "QUANTITY"], [122, 135, "INGREDIENT"], [136, 143, "QUANTITY"], [144, 176, "INGREDIENT"], [187, 194, "PROCESS"], [237, 244, "INGREDIENT"], [281, 290, "INGREDIENT"], [396, 399, "PROCESS"], [413, 422, "INGREDIENT"], [462, 471, "INGREDIENT"], [499, 502, "PROCESS"], [567, 576, "INGREDIENT"], [627, 640, "INGREDIENT"], [651, 664, "INGREDIENT"], [829, 832, "PROCESS"], [901, 908, "INGREDIENT"], [963, 972, "INGREDIENT"], [1045, 1058, "INGREDIENT"], [1068, 1077, "INGREDIENT"], [1169, 1177, "PROCESS"], [1182, 1197, "INGREDIENT"], [1207, 1212, "PROCESS"], [1340, 1343, "INGREDIENT"]]}]