["Ingredients:\n1/2 cup vegan butter, melted\n1/4 cup granulated sugar\n1 cup all purpose flour\n1/4 teaspoon salt\n3/4 cup lemon juice (from about 4 large lemons)\noptional: 2 teaspoons lemon zest\n1 1/2 cups granulated sugar\n1 1/4 cups full fat coconut milk, using mostly the white part\n6 tablespoons cornstarch\ntiny pinch of turmeric, optional for color (1/8th teaspoon)\npowdered sugar, for dusting the tops\n\nInstructions:\nPreheat the oven to 350 degrees F and line an 8 by 8 inch pan with parchment paper, leaving a little overhang for easy removal.\nMake the crust: In a medium bowl, add the mix together the melted vegan butter, sugar and salt. Add the flour and stir until combined. The dough will be thick. Press it into the pan with your hands, evenly and firmly. Bake for 16-18 minutes until the edges are very lightly browned. Set aside.\nMake the filling: In a medium saucepan, add the lemon juice, lemon zest if using for even more lemon flavor, sugar, coconut milk and cornstarch + tiny pinch of turmeric for color, if desired. Whisk well to dissolve the cornstarch. Heat over medium heat, stirring constantly until the sugar dissolves and the mixture thickens. (see photos in post above for reference)\nSpread the filling over the crust evenly, using a spatula if needed to smooth. Bake for 15 minutes, then remove from the oven and let cool at room temperature for 30 minutes. Transfer to the refrigerator for an additional 1-2 hours, or overnight, until set.\nLift the bars out of the pan with the parchment paper, dust generously with powdered sugar and cut into 16 squares.\nLeftover bars will keep for up to 1 week in a covered container in the refrigerator. They freeze well, too. Enjoy!", {"entities": [[13, 20, "QUANTITY"], [21, 41, "INGREDIENT"], [42, 49, "QUANTITY"], [50, 66, "INGREDIENT"], [67, 72, "QUANTITY"], [73, 90, "INGREDIENT"], [91, 103, "QUANTITY"], [104, 108, "INGREDIENT"], [109, 116, "QUANTITY"], [117, 128, "INGREDIENT"], [167, 178, "QUANTITY"], [179, 189, "INGREDIENT"], [190, 200, "QUANTITY"], [201, 217, "INGREDIENT"], [218, 228, "QUANTITY"], [229, 279, "INGREDIENT"], [280, 293, "QUANTITY"], [294, 304, "INGREDIENT"], [319, 347, "INGREDIENT"], [365, 379, "INGREDIENT"], [579, 582, "PROCESS"], [587, 590, "PROCESS"], [604, 623, "INGREDIENT"], [625, 630, "INGREDIENT"], [635, 640, "INGREDIENT"], [649, 654, "INGREDIENT"], [659, 663, "PROCESS"], [879, 882, "PROCESS"], [887, 898, "INGREDIENT"], [900, 910, "INGREDIENT"], [948, 953, "INGREDIENT"], [955, 967, "INGREDIENT"], [972, 982, "INGREDIENT"], [999, 1017, "INGREDIENT"], [1058, 1068, "INGREDIENT"], [1093, 1101, "PROCESS"], [1123, 1128, "INGREDIENT"], [1540, 1554, "INGREDIENT"]]}]