["Ingredients:\n1 1/4  cups unsweetened non-dairy milk\n2 teaspoons apple cider vinegar\n1/2 cup aquafaba\n1/2 cup vegan butter, softened to room temperature\n1/2 cup canola oil, or melted coconut oil\n1 1/2 cups sugar\n1 tablespoon vanilla extract\n3 cups cake flour OR all purpose flour*\n1 tablespoon baking powder\n1/2 teaspoon salt\n1 Recipe Vanilla Vegan Frosting\n\nInstructions:\nPreheat the oven to 350 degrees F and prepare 2 round 8-inch cake pans by lining the bottom with parchment paper and spraying well with oil.\nMake the Vegan Buttermilk: Combine the non-dairy milk and apple cider vinegar. Stir a little, then set aside.\nMake the Aquafaba: Pour the liquid from a can of chickpeas into a small-medium bowl. Whisk well for a minute, until foamy and light. This acts similar to eggs. You can't taste it at all in the cake, don't worry! You will use 1/2 cup of this, and the liquid from 1 can is just perfect.\nUsing an electric hand mixer or stand mixer with a paddle attachment, cream together the softened vegan butter, canola oil and sugar until creamy and well combined.\nMeasure out 1/2 cup of the aquafaba, and add it to the bowl, along with the vanilla extract. Beat until well combined.\nIn a separate bowl,&nbsp; whisk together the flour, baking powder and salt.\nUsing the mixer on low speed, alternate adding the flour mixture and vegan buttermilk, mixing until just combined after each time. The batter should be fairly smooth (a few lumps are okay), but avoid over-mixing.&nbsp;\nPour the cake batter evenly into the prepared pans, and bake for 30-35 minutes, until the edges are golden brown, the surface looks and feels set, and a toothpick comes out mostly clean, with no wet batter.\nAllow the cakes to cool in the pans for 15 minutes, then carefully invert them onto a cooling rack. Allow them to cool completely before frosting. You can place them in the refrigerator to speed the cooling process along if you need to.\nFrost with my Vanilla Vegan Frosting or use the Chocolate Frosting from my Chocolate Cake Recipe. Add some sprinkles for fun, if desired. Enjoy!", {"entities": [[13, 24, "QUANTITY"], [25, 51, "INGREDIENT"], [52, 63, "QUANTITY"], [64, 83, "INGREDIENT"], [84, 91, "QUANTITY"], [92, 100, "INGREDIENT"], [101, 108, "QUANTITY"], [109, 151, "INGREDIENT"], [152, 159, "QUANTITY"], [160, 193, "INGREDIENT"], [194, 204, "QUANTITY"], [205, 210, "INGREDIENT"], [211, 223, "QUANTITY"], [224, 239, "INGREDIENT"], [240, 246, "QUANTITY"], [247, 279, "INGREDIENT"], [280, 292, "QUANTITY"], [293, 306, "INGREDIENT"], [307, 319, "QUANTITY"], [320, 324, "INGREDIENT"], [508, 511, "INGREDIENT"], [552, 566, "INGREDIENT"], [571, 590, "INGREDIENT"], [632, 640, "INGREDIENT"], [665, 681, "INGREDIENT"], [848, 855, "QUANTITY"], [887, 890, "INGREDIENT"], [997, 1018, "INGREDIENT"], [1020, 1030, "INGREDIENT"], [1035, 1040, "INGREDIENT"], [1085, 1092, "QUANTITY"], [1100, 1108, "INGREDIENT"], [1114, 1117, "PROCESS"], [1149, 1164, "INGREDIENT"], [1218, 1223, "PROCESS"], [1237, 1242, "INGREDIENT"], [1244, 1257, "INGREDIENT"], [1262, 1267, "INGREDIENT"], [1308, 1314, "PROCESS"], [1319, 1324, "INGREDIENT"], [1355, 1361, "PROCESS"], [1388, 1392, "INGREDIENT"], [1543, 1547, "PROCESS"], [1845, 1848, "INGREDIENT"], [1849, 1854, "PROCESS"], [1979, 1988, "INGREDIENT"], [2006, 2015, "INGREDIENT"]]}]