["Ingredients:\n1 1/2 cups of vegan semi-sweet chocolate chips\n1/2 cup of coconut cream\n2 tbsp espresso shot (or mix espresso powder jn 2 tbsp hot water and use )\n1/2 cup plus 2 tbsp almond flour\n1  drop of almond extract (optional)\n2 tbsp vegan cream cheese\n2 tbsp maple syrup\n1/8 tsp salt\n1/2 tsp lemon juice\n2 tbsp cocoa powder for rolling\n\nInstructions:\nAdd the coconut cream and espresso to a saucepan and bring to a boil. Switch off heat, then add the chocolate chips in. Let them sit for a few seconds, and then whisk until the chocolate is melted evenly. Set aside. If it is too thin, then refrigerate it for 10 minutes.\nTo make the cheese mixture:\nAdd all the ingredients to a bowl and mix really well. Add more almond flour as needed. If it's still too sticky, add in a tsp of neutral flour such as oat flour, and mix in. Refrigerate this mixture for 15 minutes so that it stiffens up a little bit.\nTake scoops of the cheese mixture and make it into half-inch balls, then coat these balls in the melted chocolate mixture and set it on parchment. Repeat for all of the mixture. Chill these balls for 15 minutes so that the chocolate sets and hardens a little bit. You can just put them in the freezer for faster setting. Then dip them in the chocolate again. The double-dipping creates a thick fudgy chocolate coating. You don't have to make them look pretty or even, because we are going to eventually roll them up. So however the shape is, just coat them in the thick chocolate mixture, and set them on parchment, and let them chill for another 15-20 minutes, or until they are nicely set.\nNow take all of these truffles out, add two tbsp of cocoa powder in a shallow bowl.\nTake each truffle and roll it between your palms so that it is an even sphere. The heat of your palms will help warm the chocolate and even it out. Roll them in the cocoa powder and set aside. Keep these truffles refrigerated until ready to serve.", {"entities": [[13, 23, "QUANTITY"], [24, 59, "INGREDIENT"], [60, 67, "QUANTITY"], [68, 84, "INGREDIENT"], [85, 91, "QUANTITY"], [92, 105, "INGREDIENT"], [110, 113, "PROCESS"], [114, 129, "INGREDIENT"], [133, 139, "QUANTITY"], [140, 149, "INGREDIENT"], [160, 167, "QUANTITY"], [168, 192, "INGREDIENT"], [204, 218, "INGREDIENT"], [230, 236, "QUANTITY"], [237, 255, "INGREDIENT"], [256, 262, "QUANTITY"], [263, 274, "INGREDIENT"], [275, 282, "QUANTITY"], [283, 287, "INGREDIENT"], [288, 295, "QUANTITY"], [296, 307, "INGREDIENT"], [308, 314, "QUANTITY"], [315, 339, "INGREDIENT"], [363, 376, "INGREDIENT"], [419, 423, "PROCESS"], [447, 450, "PROCESS"], [455, 470, "INGREDIENT"], [516, 521, "PROCESS"], [532, 541, "INGREDIENT"], [584, 588, "PROCESS"], [692, 695, "PROCESS"], [718, 730, "INGREDIENT"], [768, 771, "PROCESS"], [792, 797, "INGREDIENT"], [806, 815, "INGREDIENT"], [821, 824, "PROCESS"], [1010, 1019, "INGREDIENT"], [1129, 1138, "INGREDIENT"], [1174, 1177, "INGREDIENT"], [1248, 1257, "INGREDIENT"], [1306, 1315, "INGREDIENT"], [1476, 1485, "INGREDIENT"], [1634, 1637, "PROCESS"], [1650, 1662, "INGREDIENT"], [1687, 1691, "INGREDIENT"], [1803, 1812, "INGREDIENT"], [1847, 1859, "INGREDIENT"]]}]