["Ingredients:\n1  Healthy Vegan Pie Crust ((see below for options))\n(1) 13.5 oz can full fat coconut milk, divided\n3 tablespoons cornstarch\n1/2 cup granulated sugar\n1/4 teaspoon salt\n2 tablespoons coconut oil\n1 1/2 teaspoons pure vanilla extract\n3 large bananas, sliced\n1 container non-dairy whipped cream (I used SoDelicious Coco Whip) ((see below for options))\n\nInstructions:\nPre-bake Healthy Vegan Pie Crust, then let it cool while you make the custard filling. You could also use my Easy Vegan Pie Crust, or a store bought crust such as a cookie crust.\nIn a small bowl, add 1/2 cup of the coconut milk and cornstarch. Stir well and set aside.\nIn a small pot over medium heat, whisk together the rest of the can of coconut milk, sugar and salt. Bring to a gentle simmer.\nQuickly stir the cornstarch/milk mixture once more, then add it to the pot. Bring the mixture to a boil, whisking frequently for 5-10 minutes, until it starts to thicken. It won&#039;t quite look as thick as custard yet, but it will firm up as it cools.\nRemove from heat, and stir in the coconut oil and vanilla. Pour the custard mixture into the pre-baked and cooled crust. Let cool at room temperature for 10 minutes, then move to the refrigerator and chill for 2-4 hours or overnight. Cover with plastic wrap if desired, to help prevent a film from forming on the custard.\nOnce the pie is cool, slice the bananas. Layer most of the banana slices on top of the custard filling, saving some to decorate the top if desired.\nCover the pie with vegan whipped topping. I used SoDelicious Coco Whip. If you can&#039;t find a whipped topping at the store, you can make my Vegan Whipped Cream or Coconut Whipped Cream. Decorate with more banana slices right before serving, if desired.\nServe immediately, and refrigerate any leftovers. The pie will only keep for 1-2 days in the refrigerator.", {"entities": [[78, 112, "INGREDIENT"], [113, 126, "QUANTITY"], [127, 137, "INGREDIENT"], [138, 145, "QUANTITY"], [146, 162, "INGREDIENT"], [163, 175, "QUANTITY"], [176, 180, "INGREDIENT"], [181, 194, "QUANTITY"], [195, 206, "INGREDIENT"], [207, 222, "QUANTITY"], [223, 243, "INGREDIENT"], [324, 333, "INGREDIENT"], [380, 384, "PROCESS"], [512, 524, "INGREDIENT"], [572, 575, "PROCESS"], [576, 583, "QUANTITY"], [591, 603, "INGREDIENT"], [608, 618, "INGREDIENT"], [678, 683, "PROCESS"], [709, 728, "INGREDIENT"], [730, 735, "INGREDIENT"], [740, 745, "INGREDIENT"], [780, 784, "PROCESS"], [789, 799, "INGREDIENT"], [800, 804, "INGREDIENT"], [829, 832, "PROCESS"], [871, 875, "PROCESS"], [1048, 1052, "PROCESS"], [1060, 1071, "INGREDIENT"], [1076, 1083, "INGREDIENT"], [1123, 1128, "PROCESS"], [1279, 1283, "PROCESS"], [1557, 1566, "INGREDIENT"], [1627, 1630, "INGREDIENT"], [1662, 1683, "INGREDIENT"]]}]