["Ingredients:\n1/2 cup Semolina flour (or Brown rice flour for Glutenfree)\n1/2 cup Coconut flakes (dried)\n1 Tablespoon Coconut oil (optional. Omit to make Oilfree)\n2 Tablespoons chopped cashew pieces (optional. Omit to make nutfree)\na pinch of salt\n1/2 cup ground raw sugar (or use jaggery powder)\n3 Tablespoons water\n1/8-1/4 teaspoon cardamom powder (depends on how much you love cardamom:)\n\nInstructions:\nIn a large pan, dry roast the semolina on medium-low heat for 6-8 minutes until the color changes and it gets fragrant.\nUsing a blender/processor, blend the coconut flakes to make coarse coconut flour.\nAdd the blended coconut, coconut oil, salt and cashew pieces to the pan. Mix well and roast for 2 minutes.\n(Coconut oil and cashew pieces can be left out to make nut free and oilfree)\nMeanwhile, in another pan, make the sugar syrup.\nAdd all syrup ingredients and bring to a boil over medium heat. Continue to cook at medium low until one thread consistency- 230 to 235 degrees F / 110c.(a few minutes).\nAdd the hot sugar syrup to the roasting dry ingredients and mix well to form a lumpy mixture. (Best results when both contents are hot)\nTake off heat. Cool for 2-3 minutes and form balls - Ladoo. Spray a little water if the mixture is too crumbly.\nOr Press immediately into parchment lined or greased baking pan to make Burfi. (I used an 8 by 4 inch pan.) The mixture gets too crumbly as it cools. So shape when still warm-hot. Handle carefully.\nCut into squares when still warm. The bars will harden as they cool.\nBreak into pieces when cool. Store in airtight container for upto a week.", {"entities": [[13, 20, "QUANTITY"], [21, 35, "INGREDIENT"], [40, 56, "INGREDIENT"], [73, 80, "QUANTITY"], [81, 95, "INGREDIENT"], [104, 116, "QUANTITY"], [117, 128, "INGREDIENT"], [162, 175, "QUANTITY"], [176, 197, "INGREDIENT"], [233, 246, "INGREDIENT"], [247, 254, "QUANTITY"], [255, 271, "INGREDIENT"], [296, 309, "QUANTITY"], [310, 315, "INGREDIENT"], [320, 332, "QUANTITY"], [333, 348, "INGREDIENT"], [379, 387, "INGREDIENT"], [425, 430, "PROCESS"], [435, 443, "INGREDIENT"], [562, 576, "INGREDIENT"], [592, 605, "INGREDIENT"], [623, 631, "INGREDIENT"], [632, 643, "INGREDIENT"], [645, 649, "INGREDIENT"], [693, 698, "PROCESS"], [715, 726, "INGREDIENT"], [745, 748, "INGREDIENT"], [827, 838, "INGREDIENT"], [881, 885, "PROCESS"], [916, 920, "PROCESS"], [1022, 1033, "INGREDIENT"], [1041, 1049, "PROCESS"], [1070, 1073, "PROCESS"], [1221, 1226, "INGREDIENT"], [1311, 1317, "PROCESS"]]}]