["Ingredients:\n1 cup chickpea flour (garbanzo bean flour)\n1/2 tsp salt\n1/4 tsp pepper flakes or to taste\n1/2 tsp rosemary\n1 cup water\n1  Recipe chimichurri sauce\nOr 1 Recipe Vegan Pesto ((use chimichurri for nutfree))\n3 oz sliced mushrooms\n1 tsp olive oil\nOther veggies such as sliced bell pepper (sun dried tomato, sliced jalapeno, zucchini or olives)\n\nInstructions:\nSocca Pizza Crust: Mix all the dry ingredients in a bowl until well mixed.\nAdd 3/4 cup water and mix (use a whisk for faster mixing), Add more water to make a thick smooth batter, lump free batter that is just a tad bit thinner than pancake batter. Cover and let it rest for at least half an hour to overnight. If keeping overnight, cover the bowl and refrigerate.\nMake Socca Crust on Stove top: Heat a cast iron skillet over medium heat. When hot add a few drops of oil and spread well. Add a ladle-full of the batter. Cook for 4 to 6 minutes then use a spatula to loosen the flatbread. If it is still sticking, let the bread cook longer and then try again. Flip.\nOr Bake the Socca: Preheat the oven to 450 deg F(230 C). Place the cast iron skillet in the oven for 20 mins. Remove the skillet carefully, drizzle oil and spread the batter on it. Bake for 10 minutes depending on the batter thickness.\nSpread the chimichurri or pesto on the socca. Mix the sliced mushrooms with 1 tsp olive oil and 1/2 tsp herbs of choice such as oregano or thyme. Then spread them on the socca. Add the veggies. Add shredded vegan cheese if you like.\nBake the pizza at 450 F (230 C) for another 6 to 8 mins. Remove from the oven. (I prefer to cook the socca on the skillet, then bake it with the toppings)\nTo cook the Pizza on Stove top: Cover the skillet with a lid and cook for another 3 to 5 mins.\nAdd fresh herbs, micro greens greens or micro sprouts, pepper flakes, slice and serve.Store refrigerated for about 3 days. Reheat in the oven.", {"entities": [[13, 18, "QUANTITY"], [19, 33, "INGREDIENT"], [49, 54, "INGREDIENT"], [56, 63, "QUANTITY"], [64, 68, "INGREDIENT"], [69, 76, "QUANTITY"], [77, 102, "INGREDIENT"], [103, 110, "QUANTITY"], [111, 119, "INGREDIENT"], [120, 131, "INGREDIENT"], [216, 220, "QUANTITY"], [221, 237, "INGREDIENT"], [238, 243, "QUANTITY"], [244, 253, "INGREDIENT"], [260, 267, "INGREDIENT"], [276, 294, "INGREDIENT"], [296, 312, "INGREDIENT"], [434, 439, "PROCESS"], [445, 452, "QUANTITY"], [453, 458, "INGREDIENT"], [463, 466, "PROCESS"], [474, 479, "PROCESS"], [491, 497, "PROCESS"], [509, 514, "INGREDIENT"], [814, 817, "PROCESS"], [830, 836, "INGREDIENT"], [993, 997, "PROCESS"], [1179, 1182, "INGREDIENT"], [1321, 1337, "INGREDIENT"], [1343, 1348, "QUANTITY"], [1349, 1358, "INGREDIENT"], [1363, 1370, "QUANTITY"], [1371, 1386, "INGREDIENT"], [1395, 1402, "INGREDIENT"], [1406, 1411, "INGREDIENT"], [1452, 1459, "INGREDIENT"], [1465, 1486, "INGREDIENT"], [1592, 1596, "PROCESS"], [1628, 1632, "PROCESS"], [1658, 1662, "PROCESS"], [1720, 1724, "PROCESS"], [1754, 1759, "INGREDIENT"], [1760, 1765, "INGREDIENT"], [1796, 1803, "INGREDIENT"], [1805, 1818, "INGREDIENT"]]}]