["Ingredients:\n2 cups raw cashews\n1 tablespoon cornstarch or other starch (, optional)\n1/3 cup water\n1/2 cup ground raw sugar\nFlavor options: 1/4 teaspoon cardamom powder (6 strands of saffron, or a few drops of kewra or rose essence)\n\nInstructions:\nGrind the cashews to a powder in a dry grinder and keep aside. If using a blender, add cornstarch and then blend. Move the buttery cashew powder from the sides of the blender in between to help with even blending.\nMake the sugar syrup: In a saucepan over medium heat, combine water and sugar and mix well. Bring to a boil, about 3 minutes. Continue to cook over medium heat, until the syrup is a just about single thread consistency (close to 230F / 110c), 3 to 4 minutes. (See note below for how to check single thread consistency.) Stir a few times in between. The syrup will get bubbly while it thickens. Add cardamom or other flavors and mix in.\nReduce heat to low, then add half of the ground cashews. Mix in well. Keep adding the cashew mixture, a few tablespoons at a time, until the mixture gets thick and adds resistance to the movement of the spatula. Mix well each time by dragging and mixing. The mixture will be somewhere between a thick batter and a soft dough. You will use up anywhere from 1 1/2 cups to the entire 2 cups cashews.\nTransfer the hot mixture to parchment or a greased flat plate or pan. Carefully pat it down or shape using a spatula, into a 1/4 inch thick somewhat rectangle. If the mixture is too sticky or hot, let it cool for a minute before patting it down. You can also roll it between 2 parchments. You can knead the mixture a bit at this point to make it smoother, before shaping into a rectangle.\nUsing a knife or pizza cutter, cut the rectangle into a grid. Let cool completely before separating into pieces and storing. Store in an airtight container for a few days on the counter or several weeks refrigerated.", {"entities": [[13, 19, "QUANTITY"], [20, 31, "INGREDIENT"], [32, 44, "QUANTITY"], [45, 71, "INGREDIENT"], [85, 92, "QUANTITY"], [93, 98, "INGREDIENT"], [99, 106, "QUANTITY"], [107, 123, "INGREDIENT"], [140, 152, "QUANTITY"], [153, 168, "INGREDIENT"], [183, 190, "INGREDIENT"], [258, 265, "INGREDIENT"], [331, 334, "PROCESS"], [335, 345, "INGREDIENT"], [471, 482, "INGREDIENT"], [524, 529, "INGREDIENT"], [534, 539, "INGREDIENT"], [544, 547, "PROCESS"], [565, 569, "PROCESS"], [600, 604, "PROCESS"], [860, 868, "INGREDIENT"], [890, 893, "PROCESS"], [923, 926, "PROCESS"], [939, 945, "INGREDIENT"], [946, 953, "INGREDIENT"], [973, 979, "PROCESS"], [1119, 1123, "INGREDIENT"], [1145, 1151, "PROCESS"], [1254, 1264, "QUANTITY"], [1279, 1285, "QUANTITY"], [1286, 1293, "INGREDIENT"], [1545, 1548, "INGREDIENT"], [1588, 1591, "INGREDIENT"], [1592, 1597, "PROCESS"]]}]