["Ingredients:\n1 cup chickpea flour (, I use Bobs Red Mill Chickpea/Garbanzo Bean Flour)\n1 Tablespoon flaxseed meal or chia seed meal\n1/2 tsp salt\n1/4 tsp each of turmeric (garlic powder, kala namak(Indian black salt), baking soda, cumin powder)\n3 Tbsp non dairy plain yogurt (, unsweetened or lightly sweetened, I used unsweetened So Delicious coconut milk yogurt)\n1 1/4 cup water\ntomato slices\nred onion slices\nraw jalapeno slices or pickled jalapeno slices\nchopped cilantro (optional)\nVariations: Add 1 to 2 Tbsp nutritional yeast for cheesy flavor. Add 1/4 tsp carom seeds/ajwain for Indian Chilla flavor. Add chopped cilantro and veggies to the batter.\n\nInstructions:\nIn a bowl, mix all dry ingredients.\nAdd the non dairy yogurt and 1 cup of water to dry and mix in. Add more water if needed to make a thick pour-able batter. Mix well so there are no lumps. let sit for 2 mins.\nHeat a heavy bottom skillet at medium heat. When the skillet is hot, spray or brush oil to grease. Place tomato, onion and jalapeno slices on the pan. Mix and Pour the batter to cover the slices. Move the pan if needed to move the batter around.\n* Alternatively, pour the batter and spread on the pan. then place the vegetable slices on the batter. This will be easier to flip than the veggies at the bottom.&nbsp; Make thinner and smaller pancakes to get a hang of these to start with.\nCook for 4 to 7 mins, depends on the pan and the thickness of the pancake. The first pancake usually takes longer as the pan heats up.\nYou can serve it as soon as the center is set. or flip very carefully and cook for another 2 to 3 mins and serve. Serve hot with ketchup, Sriracha, chutneys, roasted potatoes, hash browns or other breakfast fix ins.", {"entities": [[13, 18, "QUANTITY"], [19, 33, "INGREDIENT"], [80, 85, "INGREDIENT"], [87, 99, "QUANTITY"], [100, 131, "INGREDIENT"], [132, 139, "QUANTITY"], [140, 144, "INGREDIENT"], [145, 152, "QUANTITY"], [153, 169, "INGREDIENT"], [171, 184, "INGREDIENT"], [204, 214, "INGREDIENT"], [217, 228, "INGREDIENT"], [230, 242, "INGREDIENT"], [244, 250, "QUANTITY"], [251, 273, "INGREDIENT"], [343, 355, "INGREDIENT"], [356, 362, "INGREDIENT"], [364, 373, "QUANTITY"], [374, 379, "INGREDIENT"], [380, 386, "INGREDIENT"], [394, 410, "INGREDIENT"], [434, 450, "INGREDIENT"], [458, 474, "INGREDIENT"], [507, 513, "QUANTITY"], [514, 655, "INGREDIENT"], [682, 685, "PROCESS"], [715, 731, "INGREDIENT"], [736, 741, "QUANTITY"], [742, 750, "INGREDIENT"], [762, 765, "PROCESS"], [779, 784, "INGREDIENT"], [965, 968, "INGREDIENT"], [986, 992, "INGREDIENT"], [994, 999, "INGREDIENT"], [1188, 1193, "PROCESS"], [1267, 1274, "INGREDIENT"], [1507, 1510, "INGREDIENT"], [1577, 1581, "PROCESS"], [1632, 1639, "INGREDIENT"], [1641, 1649, "INGREDIENT"], [1661, 1668, "PROCESS"], [1669, 1677, "INGREDIENT"]]}]