["Ingredients:\n1  Vegan Pie Crust*\n1 pound sweet potatoes (about 2 medium)\n3/4 cup full fat coconut milk\n1 cup brown sugar\n1 teaspoon pure vanilla extract\n1 teaspoon ground cinnamon\n1/4  teaspoon ground ginger\n1/2 teaspoon ground nutmeg\n1/4 teaspoon salt\n4 tablespoons cornstarch*\nvegan whipped cream, optional for serving\n\nInstructions:\nPrepare the Vegan Pie Crust as directed. There is no need to pre-cook the crust. You may also use a store bought vegan crust or this Healthy Vegan Pie Crust for a gluten free, lighter option. Once the pie pan is lined with the uncooked crust, place it in the refrigerator while you prepare the filling.\nPreheat the oven to 350 degrees F. Peel and chop the sweet potatoes, then place them in a medium saucepan and add enough water to cover. Bring to a boil, then reduce the heat and simmer for 12-15 minutes until fork tender. Drain the potatoes and add them to a large bowl (or a stand mixer if you have one).\nWith a mixer, beat the potatoes until smooth, then add all the remaining ingredients (except the whipped cream!) and beat on high speed until smooth and combined.\nSpread the sweet potato filling into the pie crust evenly, and bake for 55-60 minutes, until the center is only slightly jiggly. If the crust begins to burn or brown too much, use a pie shield or cover the edges with aluminum foil for the last half of baking.\nAllow the pie to cool on a cooling rack for about an hour before slicing and serving. Serve with vegan whipped cream, if desired. Store leftover pie in the refrigerator for 5 days. Enjoy!", {"entities": [[47, 55, "INGREDIENT"], [73, 80, "QUANTITY"], [81, 102, "INGREDIENT"], [103, 108, "QUANTITY"], [109, 120, "INGREDIENT"], [121, 131, "QUANTITY"], [132, 152, "INGREDIENT"], [153, 163, "QUANTITY"], [164, 179, "INGREDIENT"], [180, 193, "QUANTITY"], [194, 207, "INGREDIENT"], [208, 220, "QUANTITY"], [221, 234, "INGREDIENT"], [235, 247, "QUANTITY"], [248, 252, "INGREDIENT"], [253, 266, "QUANTITY"], [267, 278, "INGREDIENT"], [401, 405, "PROCESS"], [436, 448, "INGREDIENT"], [579, 584, "PROCESS"], [698, 706, "INGREDIENT"], [713, 718, "PROCESS"], [749, 752, "PROCESS"], [760, 765, "INGREDIENT"], [787, 791, "PROCESS"], [872, 880, "INGREDIENT"], [885, 888, "PROCESS"], [969, 977, "INGREDIENT"], [997, 1000, "PROCESS"], [1120, 1132, "INGREDIENT"], [1172, 1176, "PROCESS"], [1361, 1367, "PROCESS"]]}]