["Ingredients:\n1 cup unsweetened soy milk\n1 packet instant yeast ( 2 1/4 tsp)\n1/3 cup granulated sugar\n1/2 cup unsweetened applesauce\n6 tablespoons vegan butter, softened to room temperature\n1 teaspoon pure vanilla extract\n1/2 teaspoon salt\n4 cups all purpose flour, plus more as needed\nvegetable oil, for frying\n8 ounces seedless raspberry jelly, or other jelly\npowdered sugar, for dusting OR granulated sugar for rolling in\n\nInstructions:\nMicrowave the soy milk for about 1 minute if refrigerated, so that it&#039;s as warm as bath water. You don&#039;t want it to boil, so watch closely. If you don&#039;t have a microwave, warm it in a small pan.\nIn a large bowl, or the bowl of a stand mixer, stir together the warm soy milk, yeast and sugar. Let the mixture sit for 3-4 minutes, until it&#039;s a bit frothy.\nTo the bowl with the yeast mixture, add the applesauce, softened vegan butter, vanilla, salt and 2 cups of flour. Mix on low speed with a dough hook, or by hand with a large wooden spoon, for a few minutes, then add the rest of the flour and continue to mix.\nIf using a stand mixer, beat with the dough hook for about 2-3 minutes. If you are making them by hand, mix it as well as you can with a spoon, then transfer to a lightly floured surface and knead the dough for about 5 minutes until you have a nice soft ball of dough.\nLightly grease a large bowl (I use non-stick spray) then place the dough in the bowl. Cover with a clean kitchen towel, then allow to rise in a warm place for 30 minutes. I preheat my oven to 170, then turn it off and place the bowl inside with the door cracked.\nAfter 30 minutes, punch the dough down. Place it on a lightly floured surface and roll it about 1/2 inch thick. Use a donut cutter or a large biscuit cutter to cut the donuts. You should get about 16-18.\nLine a large baking sheet or two with parchment paper, and place the cut donuts on the pans. Cover with a large towel for about 15 minutes while you heat the oil.\nHeat 2-3 inches of oil in a large pan or pot until it reaches 375. I highly suggest using a thermometer so you get this just right.\nAdd a few donuts at a time to the oil and cook for about 1-2 minutes on each side, until golden brown, being careful not to let them get too dark and burnt. If the oil is hot, this won&#039;t take long. Be careful of hot oil!\nPlace the cooked donuts on a cooling rack with a pan or parchment paper underneath to catch any oil drippings. Repeat until all donuts are fried.\nCut a deep slit into the side of each donut, then use a piping bag with tip to pipe jelly into each one. Dust the tops with powdered sugar or roll in granulated sugar. Serve and enjoy!", {"entities": [[13, 18, "QUANTITY"], [19, 39, "INGREDIENT"], [49, 62, "INGREDIENT"], [65, 74, "QUANTITY"], [76, 83, "QUANTITY"], [84, 100, "INGREDIENT"], [101, 108, "QUANTITY"], [109, 131, "INGREDIENT"], [132, 145, "QUANTITY"], [146, 188, "INGREDIENT"], [189, 199, "QUANTITY"], [200, 220, "INGREDIENT"], [221, 233, "QUANTITY"], [234, 238, "INGREDIENT"], [239, 245, "QUANTITY"], [246, 284, "INGREDIENT"], [285, 310, "INGREDIENT"], [311, 319, "QUANTITY"], [320, 360, "INGREDIENT"], [361, 375, "INGREDIENT"], [392, 408, "INGREDIENT"], [453, 461, "INGREDIENT"], [532, 537, "INGREDIENT"], [565, 569, "PROCESS"], [696, 700, "PROCESS"], [719, 727, "INGREDIENT"], [729, 734, "INGREDIENT"], [739, 744, "INGREDIENT"], [834, 839, "INGREDIENT"], [849, 852, "PROCESS"], [857, 867, "INGREDIENT"], [869, 890, "INGREDIENT"], [892, 899, "INGREDIENT"], [901, 905, "INGREDIENT"], [910, 916, "QUANTITY"], [917, 925, "INGREDIENT"], [1025, 1028, "PROCESS"], [1045, 1050, "INGREDIENT"], [1067, 1070, "PROCESS"], [1176, 1179, "PROCESS"], [1198, 1201, "INGREDIENT"], [1263, 1268, "PROCESS"], [1398, 1403, "PROCESS"], [1490, 1495, "PROCESS"], [1559, 1564, "PROCESS"], [1821, 1827, "PROCESS"], [1867, 1872, "PROCESS"], [1966, 1969, "INGREDIENT"], [1987, 1993, "INGREDIENT"], [2137, 2140, "INGREDIENT"], [2145, 2149, "PROCESS"], [2175, 2179, "INGREDIENT"], [2267, 2270, "INGREDIENT"], [2324, 2327, "INGREDIENT"], [2339, 2345, "INGREDIENT"], [2425, 2428, "INGREDIENT"], [2468, 2473, "PROCESS"], [2508, 2512, "INGREDIENT"], [2570, 2574, "INGREDIENT"], [2599, 2613, "INGREDIENT"], [2625, 2641, "INGREDIENT"]]}]