["Ingredients:\n1 cup whole wheat flour\n1 cup warm water\n2.5 tbsp maple syrup or other sweetener of choice\n1 tbsp active yeast (1 tablespoon = 3 tsp)\n2 cups whole wheat flour\n1 tsp salt\n2 tbsp oil\n1 to 1.5 tsp lemon or lime juice\n1/4 tsp ground cumin\n2 tbsp water\noil or vegan butter as needed.\n\nInstructions:\nMix the ingredients under Sponge in a bowl. Mix for 2 to 3 minutes until a smooth batter and you can feel the gluten forming. It will start to get a bit stringy\nLet the bowl sit for 1 hour in a warm place. (Use a large bowl as the sponge will triple)\nIn a stand mixer, add the sponge. Mix the salt into the 2 cups flour and add the flour to the stand mixer. Start kneading. Add in the oil, cumin, lemon juice and water and continue to knead for 5 minutes. Let the dough rest for 5 minutes. Check the dough to see if it needs more flour or water (it should be soft and smooth. not stiff and not sticky). Add more water if needed. .\nKnead for another 5 to 8 minutes. The dough should not break immediately when a small portion is pulled out. (I knead at setting 2 on my kitchen aid). You can let the dough rest for 15-20 minutes at this point.\nShape the dough into a fat 9 by 5 rectangle. Fold in the 5 inch side. then roll the longer side like a jelly roll. Seal by pinching. Roll the log a little to even it out in thickness. Place in the parchment lined or well greased bread pan (9 by 5 inch). Spray water on top. Sprinkle sesame seeds or oats. Spray water again. Cover with a towel and let rise for 50 minutes to an hour or until it doubles or the bread domes over the pan edge. (You want to give the bread enough time to rise and get airy. the time depends on the ambient temperature.)Spray water, then spray oil on the top.\nPre-heat the oven to 350 degrees F / 180c. Bake the bread for 40 minutes.\nRemove the bread pan from the oven and brush oil or vegan butter on top. Remove the bread from the pan after 5 to 10 minutes. Let it cool completely before slicing with a serrated knife.\nStore in a bread container on the counter for upto 2 days or refrigerate for upto a week.", {"entities": [[13, 18, "QUANTITY"], [19, 36, "INGREDIENT"], [39, 53, "INGREDIENT"], [63, 103, "INGREDIENT"], [104, 110, "QUANTITY"], [111, 123, "INGREDIENT"], [125, 137, "QUANTITY"], [140, 145, "QUANTITY"], [147, 153, "QUANTITY"], [154, 171, "INGREDIENT"], [172, 177, "QUANTITY"], [178, 182, "INGREDIENT"], [183, 189, "QUANTITY"], [190, 193, "INGREDIENT"], [207, 226, "INGREDIENT"], [227, 234, "QUANTITY"], [235, 247, "INGREDIENT"], [248, 254, "QUANTITY"], [255, 260, "INGREDIENT"], [261, 280, "INGREDIENT"], [404, 407, "INGREDIENT"], [506, 511, "PROCESS"], [576, 579, "PROCESS"], [600, 604, "INGREDIENT"], [614, 620, "QUANTITY"], [621, 626, "INGREDIENT"], [631, 634, "PROCESS"], [639, 644, "INGREDIENT"], [692, 695, "INGREDIENT"], [697, 702, "INGREDIENT"], [704, 715, "INGREDIENT"], [720, 725, "INGREDIENT"], [742, 747, "PROCESS"], [837, 842, "INGREDIENT"], [846, 851, "INGREDIENT"], [919, 924, "INGREDIENT"], [1050, 1055, "PROCESS"], [1093, 1096, "INGREDIENT"], [1409, 1414, "INGREDIENT"], [1432, 1444, "INGREDIENT"], [1448, 1452, "INGREDIENT"], [1460, 1465, "INGREDIENT"], [1702, 1707, "INGREDIENT"], [1720, 1723, "INGREDIENT"], [1855, 1874, "INGREDIENT"]]}]