["Ingredients:\n1 cup unsweetened soy milk\n1 tablespoon apple cider vinegar\n2 1/2  cups all purpose flour, plus more as needed\n2 tablespoons baking powder\n2 teaspoons granulated sugar\n1 teaspoon salt\n1/2 cup (8 tbs) cold vegan butter\n\nInstructions:\nPreheat the oven to 425 degrees F and line a baking sheet with parchment paper (or lightly spray with oil). Measure 1/2 cup (8 tbs) vegan butter, cut into small pieces and place in the freezer for 5 minutes. You want the butter to be very cold for flaky, tall biscuits.\nIn a glass measuring cup, combine the soy milk and apple cider vinegar. Set aside to curdle. This is your vegan buttermilk.\nAdd the flour, baking powder, sugar and salt to a large mixing bowl or food processor. Whisk or pulse to combine. Now add the vegan butter pieces to the dry and either cut into the dry ingredients using a pastry cutter OR pulse several times in the processor until coarse crumbs form. If you used a food processor, dump the mixture into a large bowl.\nPour the vegan buttermilk into the bowl with the rest of the ingredients, saving a little bit for brushing on the tops (about 2 tablespoons). Gently stir until almost combined, but do not over mix. It will not be a clean ball of dough at this point, and it will be quite moist and sticky. See photos above in post for a visual reference.\nScoop the dough onto a lightly floured surface and gently work it together with your hands, shaping it into a rectangle. Flour your hands to prevent sticking, and sprinkle a little flour on the dough if it&#039;s very sticky. Just do not add too much, or the biscuits will be dry.\nGently flatten the dough into a rectangle, then fold one side into the center, then the other side. Turn the dough a half turn, and flatten again into a rectangle shape. Repeat the process two more times. This is what makes all those wonderful layers!\nOn the last folding, gently flatten the dough until it&#039;s about 1 inch thick. Cut into circles using a biscuit cutter, and do not twist the cutters. Try to get as many biscuits the first time. Re roll any scraps until you have 10-12 biscuits.\nArrange them so they are touching on the pan, this helps them bake up tall. Brush the tops with the remaining buttermilk and bake for 15-20 minutes, or until golden brown on top and tall. Serve warm with a dab of vegan butter and jam.\nCover any leftover biscuits and keep at room temperature for 3-4 days, or a bit longer in the refrigerator. They freeze well, too.", {"entities": [[13, 18, "QUANTITY"], [19, 39, "INGREDIENT"], [40, 52, "QUANTITY"], [53, 72, "INGREDIENT"], [73, 84, "QUANTITY"], [85, 123, "INGREDIENT"], [124, 137, "QUANTITY"], [138, 151, "INGREDIENT"], [152, 163, "QUANTITY"], [164, 180, "INGREDIENT"], [181, 191, "QUANTITY"], [192, 196, "INGREDIENT"], [197, 204, "QUANTITY"], [213, 230, "INGREDIENT"], [291, 297, "PROCESS"], [348, 351, "INGREDIENT"], [362, 369, "QUANTITY"], [378, 390, "INGREDIENT"], [418, 423, "PROCESS"], [467, 473, "INGREDIENT"], [537, 540, "QUANTITY"], [554, 562, "INGREDIENT"], [567, 586, "INGREDIENT"], [648, 653, "INGREDIENT"], [655, 668, "INGREDIENT"], [670, 675, "INGREDIENT"], [680, 684, "INGREDIENT"], [696, 702, "PROCESS"], [758, 761, "PROCESS"], [766, 778, "INGREDIENT"], [955, 959, "PROCESS"], [1117, 1130, "QUANTITY"], [1140, 1144, "PROCESS"], [1184, 1187, "PROCESS"], [1450, 1455, "INGREDIENT"], [1492, 1500, "PROCESS"], [1510, 1515, "INGREDIENT"], [1567, 1570, "PROCESS"], [2171, 2175, "PROCESS"], [2234, 2238, "PROCESS"], [2322, 2334, "INGREDIENT"]]}]