["Ingredients:\n1 1/4 cups unsweetened soy milk\n2 teaspoons apple cider vinegar\n3 cups all purpose flour\n4 tablespoons natural cocoa powder\n1 tablespoon baking powder\n1/2 teaspoon salt\n1/2 cup vegan butter, softened to room temperature\n1 1/2 cups granulated sugar\n1/2 cup canola oil\n1/2 cup applesauce\n1 tablespoon pure vanilla extract\n1 teaspoon white vinegar\n2-3 tablespoons red dye (vegan) (OR beetroot powder)\nDouble Recipe Vegan Cream Cheese Frosting\n\nInstructions:\nPreheat the oven to 350 degrees F and spray (2) 8-inch cake pans with oil. I also put a small parchment paper circle in the bottom, to prevent sticking. Set aside.\nMake the Vegan Buttermilk: Pour the soy milk into a measuring cup and stir in the apple cider vinegar. Set aside to curdle; this is your \"buttermilk.\"\nAdd all the dry ingredients to a medium sized bowl and whisk to combine. If your cocoa powder is very clumpy, sift it into the bowl.\nUsing a hand mixer (or a stand mixer), beat the butter and sugar together until smooth. Now mix in the canola oil, applesauce, vanilla and white vinegar. Beat until smooth. Mix in the red dye (or beetroot powder.)\nWith the mixer on low speed, add the dry ingredients alternating with the \"buttermilk\", in about three additions, until just incorporated.\nDivide the batter equally into prepared pans. Bake for 35-40 minutes, until a toothpick inserted in the middle comes out clean.&nbsp;\nLet cool on wire racks for 5-10 minutes, then run a knife around the edges to loosen, and carefully invert the cakes onto your hand. Remove the parchment paper and place on a wire rack to cool completely before frosting.\nOnce the cakes are completely cooled, evenly cover the first layer with cream cheese frosting. At this point I like to stick the first layer in the fridge for 10 minutes, to ensure the frosting firms up and won't cause the second layer to slip. Then place the second layer on top, and frost the cake as desired.&nbsp;\nKeep this cake refrigerated until ready to serve, and any leftover cake in the fridge as well, as the frosting softens at room temperature. Alternatively, you could use Vegan Vanilla Frosting instead, if desired.", {"entities": [[13, 23, "QUANTITY"], [24, 44, "INGREDIENT"], [45, 56, "QUANTITY"], [57, 76, "INGREDIENT"], [77, 83, "QUANTITY"], [84, 101, "INGREDIENT"], [102, 115, "QUANTITY"], [116, 136, "INGREDIENT"], [137, 149, "QUANTITY"], [150, 163, "INGREDIENT"], [164, 176, "QUANTITY"], [177, 181, "INGREDIENT"], [182, 189, "QUANTITY"], [190, 232, "INGREDIENT"], [233, 243, "QUANTITY"], [244, 260, "INGREDIENT"], [261, 268, "QUANTITY"], [269, 279, "INGREDIENT"], [280, 287, "QUANTITY"], [288, 298, "INGREDIENT"], [299, 311, "QUANTITY"], [312, 332, "INGREDIENT"], [333, 343, "QUANTITY"], [344, 357, "INGREDIENT"], [360, 373, "QUANTITY"], [374, 381, "INGREDIENT"], [538, 541, "INGREDIENT"], [668, 676, "INGREDIENT"], [694, 697, "QUANTITY"], [702, 706, "PROCESS"], [714, 733, "INGREDIENT"], [838, 843, "PROCESS"], [864, 876, "INGREDIENT"], [964, 970, "INGREDIENT"], [975, 980, "INGREDIENT"], [1008, 1011, "PROCESS"], [1019, 1029, "INGREDIENT"], [1031, 1041, "INGREDIENT"], [1043, 1050, "INGREDIENT"], [1055, 1068, "INGREDIENT"], [1100, 1107, "INGREDIENT"], [1159, 1162, "PROCESS"], [1567, 1572, "PROCESS"], [1696, 1708, "INGREDIENT"], [1874, 1879, "PROCESS"]]}]