["Ingredients:\n2 cups (12 oz) vegan chocolate chips, divided\n2 tablespoons refined coconut oil\n1/2 cup creamy peanut butter (*not the natural kind if you can help it.)\n4 tablespoons powdered sugar\ncoarse sea salt, optional for sprinkling on top\n\nInstructions:\nLine a 12 cup standard size muffin tin with paper liners.\nPlace half of the chocolate chips (1 cup) and half of the coconut oil (1 tablespoon) in a microwave safe bowl. Microwave for 1 minute, stir, then another minute and stir until melted and smooth. If you do not have a microwave, you can use the double broiler method to melt.\nScoop about half of a tablespoon melted chocolate, and place it in each liner. Use a small spoon to spread it around and up the sides just a little bit. Place the pan in the freezer for 10 minutes.\nWhile the chocolate hardens in the freezer, add the peanut butter and powdered sugar to a bowl and mix with a spoon or fork until well combined and a sort of dough is formed. Taste for sweetness, and add more sugar if desired. If using unsalted peanut butter, add a tiny pinch of salt.\nRemove the pan from the freezer. The chocolate should be quite firm and not melty anymore. Place a tablespoon of the peanut butter mixture on top of the chocolate in each cup, and press down a bit with your hands. It does not need to be flattened completely. Place the pan in the freezer for 10 minutes.\nMelt the other cup of chocolate chips and the last tablespoon of coconut oil, as you did before. Scoop 1/2 tablespoon on top of the peanut butter and spread immediately with a small spoon if needed and sprinkle with coarse sea salt, if desired. Because the peanut butter was in the freezer, the chocolate will harden quickly. Place in the freezer for 10 minutes to set.\nStorage: Store the peanut butter cups in the refrigerator or freezer, as they will melt rather quickly at room temperature because of the coconut oil. If you want them to be more shelf stable, substitute melted vegan butter for the coconut oil, or leave it out completely.", {"entities": [[13, 19, "QUANTITY"], [21, 26, "QUANTITY"], [28, 49, "INGREDIENT"], [59, 72, "QUANTITY"], [73, 92, "INGREDIENT"], [93, 100, "QUANTITY"], [101, 121, "INGREDIENT"], [152, 155, "INGREDIENT"], [166, 179, "QUANTITY"], [180, 194, "INGREDIENT"], [195, 210, "INGREDIENT"], [265, 271, "QUANTITY"], [334, 349, "INGREDIENT"], [351, 356, "QUANTITY"], [374, 385, "INGREDIENT"], [387, 399, "QUANTITY"], [451, 455, "PROCESS"], [481, 485, "PROCESS"], [547, 550, "INGREDIENT"], [630, 639, "INGREDIENT"], [645, 650, "PROCESS"], [657, 661, "INGREDIENT"], [798, 807, "INGREDIENT"], [832, 835, "PROCESS"], [840, 853, "INGREDIENT"], [858, 872, "INGREDIENT"], [887, 890, "PROCESS"], [988, 991, "PROCESS"], [997, 1002, "INGREDIENT"], [1033, 1046, "INGREDIENT"], [1048, 1051, "PROCESS"], [1059, 1072, "INGREDIENT"], [1111, 1120, "INGREDIENT"], [1191, 1204, "INGREDIENT"], [1227, 1236, "INGREDIENT"], [1240, 1244, "INGREDIENT"], [1245, 1248, "QUANTITY"], [1254, 1259, "PROCESS"], [1393, 1396, "QUANTITY"], [1400, 1415, "INGREDIENT"], [1443, 1454, "INGREDIENT"], [1481, 1495, "QUANTITY"], [1510, 1523, "INGREDIENT"], [1580, 1588, "PROCESS"], [1594, 1609, "INGREDIENT"], [1635, 1648, "INGREDIENT"], [1673, 1682, "INGREDIENT"], [1767, 1780, "INGREDIENT"], [1886, 1897, "INGREDIENT"], [1952, 1971, "INGREDIENT"], [1980, 1991, "INGREDIENT"]]}]