["Ingredients:\n1 cup whole wheat (spelt, whole wheat pastry or white whole wheat flour)\n1.5 cups unbleached white flour  (or all purpose flour)\n1/2 to 2/3 tsp salt\n2.5 teaspoons baking powder\n1/2 teaspoon baking soda\n3 tablespoons non dairy yogurt (or use thick coconut milk or Aquafaba)\n2 tablespoons oil\n3/4 cup warm water\nflour for rolling\n\nInstructions:\nIn a bowl, whisk the flours, salt, baking powder and soda.\nAdd yogurt and oil and mix in.\nAdd water and knead for a minute or 2 until a slightly sticky dough forms. Cover and let sit for 20 to 30 minutes.\nAdd a tablespoon of flour if needed and knead for a minute until smooth.\nRoll out the dough into a log and using a pizza cutter cut into 12 to 14 equal parts. Roll each into a ball and store under a towel while you roll out the flatbreads. Roll each ball into about a 7 inch flatbread. I usually roll out the next flatbread when the first is cooking on the stove top. For baking. I roll out a half batch, bake, then roll the other half and bake.\nCook on the stove top:\nHeat a heavy bottom skillet over medium high heat. Once hot, place a rolled out flatbread on the skillet. Cover with a lid and cook for 2 minutes or until bubbles form. Remove cover, flip and cook the other side for 1 to 2 minutes or until golden.\nBake in oven:\nPre-heat oven to 450 degrees F / 230c and place a large pizza stone or thick baking sheet in the oven to heat up for at least 20 minutes.\nPlace the rolled out breads 3 to 4 at a time depending on the size of the stone. Bake for 3 to 6 minutes or until the breads puff up and get just about golden on top. Switch the oven to high broil if your oven runs less hot and pita breads take too long to puff up.\nRemove carefully from the oven and place the next batch on the stone. The baked breads will puff up like a pita bread if they were rolled out evenly. These puffed breads can be used as pita pockets.", {"entities": [[13, 18, "QUANTITY"], [19, 30, "INGREDIENT"], [32, 37, "INGREDIENT"], [39, 50, "INGREDIENT"], [61, 84, "INGREDIENT"], [95, 117, "INGREDIENT"], [123, 140, "INGREDIENT"], [149, 156, "QUANTITY"], [157, 161, "INGREDIENT"], [176, 189, "INGREDIENT"], [190, 202, "QUANTITY"], [203, 214, "INGREDIENT"], [215, 228, "QUANTITY"], [229, 245, "INGREDIENT"], [254, 272, "INGREDIENT"], [276, 284, "INGREDIENT"], [286, 299, "QUANTITY"], [300, 303, "INGREDIENT"], [308, 322, "INGREDIENT"], [323, 328, "INGREDIENT"], [367, 372, "PROCESS"], [385, 389, "INGREDIENT"], [391, 404, "INGREDIENT"], [419, 425, "INGREDIENT"], [430, 433, "INGREDIENT"], [438, 441, "PROCESS"], [450, 455, "INGREDIENT"], [460, 465, "PROCESS"], [578, 586, "INGREDIENT"], [601, 606, "PROCESS"], [725, 729, "INGREDIENT"], [806, 810, "INGREDIENT"], [903, 910, "PROCESS"], [933, 939, "PROCESS"], [966, 970, "PROCESS"], [1001, 1005, "PROCESS"], [1091, 1096, "PROCESS"], [1157, 1161, "PROCESS"], [1222, 1226, "PROCESS"], [1334, 1339, "PROCESS"], [1369, 1375, "PROCESS"], [1621, 1626, "PROCESS"], [1731, 1736, "PROCESS"], [1770, 1775, "PROCESS"], [1866, 1869, "INGREDIENT"]]}]