["Ingredients:\n1 teaspoon instant yeast\n3/4 cup warm water\n1 teaspoon granulated sugar\n2 cups all purpose flour (or white whole wheat flour)\n1 teaspoon salt\n3/4 teaspoon baking powder\n3 tablespoons coconut cream (*may omit if needed)\n2 tablespoons olive oil\nOptional: melted vegan butter for serving, minced garlic or fresh herbs\n\nInstructions:\nAdd the yeast and sugar to a large bowl and pour the warm water on top (think bath temperature, not too hot or it will kill the yeast). Let sit for a few minutes until it is frothy on top.\nNow add the flour, salt, baking powder, coconut cream and olive oil. Stir with a wooden spoon until it becomes difficult, then turn the ball of dough out on a lightly floured surface (I just use my countertop). Knead the ball of dough for about 2-3 minutes, until the ball of dough is smooth and soft. If it is too sticky, add a little more flour.\nPlace the dough in a large bowl, cover with a tea towel and let it rise for about 30 minutes. If you are in a hurry, you can skip the rising part. It will still come out quite good!\nAfter it rises, flatten the dough and divide into 8 pieces.\nHeat a large, heavy bottomed pan (cast iron preferred) over medium heat. Take a piece of the dough and roll it on a lightly floured surface into a circle or oval shape (about 1/4 inch thick). If using garlic, gently press a little minced garlic onto one side so it sticks at this point.\nPlace the dough on the heated pan and cook until large bubbles have formed and the bottom is golden brown. Flip and cook 1-2 minutes more until that side is golden brown as well.\nRepeat with the remaining pieces. Cover the naan with a towel or wrapped in foil to keep warm until ready to serve. Serve plain or brush with melted vegan butter and sprinkle with fresh herbs, such as cilantro or parsley.", {"entities": [[13, 23, "QUANTITY"], [24, 37, "INGREDIENT"], [42, 56, "INGREDIENT"], [57, 67, "QUANTITY"], [68, 84, "INGREDIENT"], [85, 91, "QUANTITY"], [92, 109, "INGREDIENT"], [114, 137, "INGREDIENT"], [139, 149, "QUANTITY"], [150, 154, "INGREDIENT"], [155, 167, "QUANTITY"], [168, 181, "INGREDIENT"], [182, 195, "QUANTITY"], [196, 209, "INGREDIENT"], [232, 245, "QUANTITY"], [246, 255, "INGREDIENT"], [266, 285, "INGREDIENT"], [299, 312, "INGREDIENT"], [316, 321, "INGREDIENT"], [322, 327, "INGREDIENT"], [351, 356, "INGREDIENT"], [361, 366, "INGREDIENT"], [396, 406, "INGREDIENT"], [471, 476, "INGREDIENT"], [536, 539, "PROCESS"], [544, 549, "INGREDIENT"], [551, 555, "INGREDIENT"], [557, 570, "INGREDIENT"], [572, 585, "INGREDIENT"], [590, 599, "INGREDIENT"], [855, 858, "PROCESS"], [873, 878, "INGREDIENT"], [1001, 1004, "INGREDIENT"], [1323, 1329, "INGREDIENT"], [1338, 1343, "PROCESS"], [1353, 1366, "INGREDIENT"], [1447, 1451, "PROCESS"], [1525, 1529, "PROCESS"], [1730, 1749, "INGREDIENT"], [1754, 1762, "PROCESS"], [1768, 1773, "INGREDIENT"], [1774, 1779, "INGREDIENT"], [1789, 1797, "INGREDIENT"], [1801, 1808, "INGREDIENT"]]}]