["Ingredients:\n2 tbsp Psyllium Husk (powdered)\n1/2 cup sweet potato or pumpkin puree\n2 tbsp water\n2 tbsp brown rice flour\n1/2 cup chickpea flour\n2 tbsp tapioca starch\n1/4 tsp baking powder\n1/4 tsp salt\na pinch of sugar\n1 tsp herbs of choice (I use thyme and rosemary)\nother additions: garam masala or red pepper flakes\n1 tsp oil\nRice flour for dusting\n\nInstructions:\nPowder the psyllium husk in a blender/grinder and add to a bowl. Mix and warm the sweet potato puree + water until warm to touch (in a microwave or on stove top). Add to the bowl. Mix well with the psyllium and let sit for 5 minutes. The mixture will become a gel.\nIn another bowl, whisk all the dry ingredients until well combined. Add the dry to the wet. Mix until well combined. Get your hands in there and press the flour into the gel. It will take about a minute for the dough to start coming together. It may seem too dry in the beginning. Mix and knead until the dough is well formed.\nAdd in the oil and knead it in for a few seconds. Let the dough sit for 5 to 10 minutes, covered.\nDivide the dough into equal balls. Smooth out each piece into a ball with as smooth edges as possible using rice flour. Roll it out into a flatbread.\nHeat a skillet over medium high heat. When the skillet is hot, place the rolled out flatbread on the skillet. Cook for 20 to 35 seconds or until small bubbles start to appear. Flip and cook the other side until the bubbles start to get bigger.\nAt thispoint, You can continue to cook it on the skillet until both sides have golden brown spots. Or you can place the flatbread over the flame. Move it every 2 to 4 seconds to puff and brown. Place flatbread in a kitchen towel. Brush vegan butter if needed. Cover and set aside.\nStore on the counter for the day or refrigerated for upto 3 days.", {"entities": [[13, 19, "QUANTITY"], [20, 33, "INGREDIENT"], [45, 52, "QUANTITY"], [53, 82, "INGREDIENT"], [83, 89, "QUANTITY"], [90, 95, "INGREDIENT"], [96, 102, "QUANTITY"], [103, 119, "INGREDIENT"], [120, 127, "QUANTITY"], [128, 142, "INGREDIENT"], [143, 149, "QUANTITY"], [150, 164, "INGREDIENT"], [165, 172, "QUANTITY"], [173, 186, "INGREDIENT"], [187, 194, "QUANTITY"], [195, 199, "INGREDIENT"], [208, 216, "INGREDIENT"], [217, 222, "QUANTITY"], [223, 238, "INGREDIENT"], [246, 251, "INGREDIENT"], [256, 264, "INGREDIENT"], [283, 298, "INGREDIENT"], [299, 316, "INGREDIENT"], [317, 322, "QUANTITY"], [323, 326, "INGREDIENT"], [332, 337, "INGREDIENT"], [376, 389, "INGREDIENT"], [415, 418, "PROCESS"], [447, 465, "INGREDIENT"], [466, 473, "INGREDIENT"], [647, 652, "PROCESS"], [775, 780, "PROCESS"], [785, 790, "INGREDIENT"], [919, 924, "PROCESS"], [968, 971, "INGREDIENT"], [976, 981, "PROCESS"], [1101, 1105, "INGREDIENT"], [1163, 1173, "INGREDIENT"], [1268, 1273, "PROCESS"], [1390, 1394, "PROCESS"], [1467, 1470, "INGREDIENT"], [1483, 1487, "PROCESS"], [1555, 1558, "INGREDIENT"], [1559, 1564, "PROCESS"], [1685, 1697, "INGREDIENT"]]}]