["Ingredients:\n3-4 cups bread flour\n1 cup whole wheat flour\n2 cups fresh strawberries pureed with minimal water ((the puree should be about 1.5 cups))\n1/4 cup warm water\n1.5 teaspoon quick rise yeast and .5 teaspoon regular active yeast\n2/3 cup canola oil\n1 tablespoon oil for greasing\n3 tablespoons sugar\n1 teaspoon non iodized salt (( Ididn't have this))\n\nInstructions:\nWarm the water and add yeast to it. Let sit for 10 minutes or until frothy.\nGrease the mixer bowl and add the flours.\nAdd in the rest of the ingredients and the yeast mixture and knead for 10-12 minutes(2-4 minutes then scrape and so on). Add more water if needed. The strawberries will keep giving out their moisture, so try to keep the dough a little on the dry side.\nKeep the dough in a well greased bowl, covered for about 1.5 hours to rise.\nPunch the dough to remove excess air and shape it into a loaf using the boule technique by pulling on all sides and tucking them under. Use some oil on your palms and some flour to avoid the stickiness. The dough will be stickier than usual, because of the extra moisture of the strawberries.\nPlace loaf in a well greased pan, cover with a towel, and let rise for 40 minutes.\nBake bread at 375 degrees F for 40-45 minutes or until it sounds nice and hollow!\nThe crust will feel hard when taken out of the oven, but an hour later it will soften up nicely.. because of the strawberries!!\nEnjoy toasted with anything, at any time of the day!", {"entities": [[17, 33, "INGREDIENT"], [34, 39, "QUANTITY"], [40, 57, "INGREDIENT"], [58, 64, "QUANTITY"], [65, 109, "INGREDIENT"], [116, 121, "INGREDIENT"], [153, 167, "INGREDIENT"], [181, 234, "INGREDIENT"], [235, 242, "QUANTITY"], [243, 253, "INGREDIENT"], [254, 266, "QUANTITY"], [267, 283, "INGREDIENT"], [284, 297, "QUANTITY"], [298, 303, "INGREDIENT"], [304, 314, "QUANTITY"], [315, 331, "INGREDIENT"], [379, 384, "INGREDIENT"], [389, 392, "PROCESS"], [393, 398, "INGREDIENT"], [472, 475, "PROCESS"], [531, 536, "INGREDIENT"], [549, 554, "PROCESS"], [618, 623, "INGREDIENT"], [639, 651, "INGREDIENT"], [961, 964, "INGREDIENT"], [988, 993, "INGREDIENT"], [1095, 1107, "INGREDIENT"], [1387, 1399, "INGREDIENT"]]}]