["Ingredients:\n16 ounces vegan cream cheese (2 containers, I used Miyokos brand)*\n1/4 cup + 2 tablespoons chopped chives or green onions\n1 1/2 cups dried cranberries, divided\n1 1/2 cups toasted chopped pecans, divided\n\nInstructions:\nIf you have raw pecans, toast them in the oven: Preheat the oven to 350 degrees F. Place the chopped pecans on a baking sheet and and bake for about 7 minutes, until fragrant. Remove from heat and let cool.\nAdd the vegan cream cheese and 1/4 cup chives/green onions (save 2 tablespoons for coating the ball) to a large bowl. With a hand mixer, beat them together until combined.\nMix in 1 cup of the cranberries and 1 cup of the toasted pecans, leaving 1/2 cup of each for coating the outside of the ball.\nPlace a clean tea towel in a small-medium sized bowl. Using a spatula, scoop all of the cheese into the bowl. Gather the corners of the towel and gently twist the top. You could also simply wrap it in plastic saran wrap. Refrigerate for 1 hour, or up to 3 days.\nWhen ready to serve, combine the rest of the cranberries, pecans and chives/green onions on a flat surface such as a cutting board. Unwrap the cheese ball and roll it gently in the mixture to coat.\nServe with crackers, pita chips or vegetables and enjoy!", {"entities": [[13, 22, "QUANTITY"], [23, 41, "INGREDIENT"], [80, 87, "QUANTITY"], [88, 134, "INGREDIENT"], [135, 145, "QUANTITY"], [146, 172, "INGREDIENT"], [173, 183, "QUANTITY"], [184, 215, "INGREDIENT"], [243, 253, "INGREDIENT"], [324, 338, "INGREDIENT"], [344, 350, "PROCESS"], [365, 369, "PROCESS"], [446, 464, "INGREDIENT"], [469, 476, "QUANTITY"], [477, 483, "INGREDIENT"], [484, 496, "INGREDIENT"], [503, 516, "QUANTITY"], [617, 622, "QUANTITY"], [630, 641, "INGREDIENT"], [646, 651, "QUANTITY"], [659, 673, "INGREDIENT"], [683, 690, "QUANTITY"], [694, 698, "INGREDIENT"], [926, 930, "PROCESS"], [951, 955, "PROCESS"], [1043, 1054, "INGREDIENT"], [1056, 1062, "INGREDIENT"], [1067, 1073, "INGREDIENT"], [1074, 1086, "INGREDIENT"], [1231, 1241, "INGREDIENT"]]}]